[
    {
        "user_name": "Yåsh kumar",
        "rating": 1,
        "text_review": "1MUST give MTFs for US Stocks 2FUTURES OPTIONS for Commodity MARKET 3 FUTURES OPTIONS for US STOCKS",
        "date": "2025-11-29 12:00:34"
    },
    {
        "user_name": "Bhupesh Pranami",
        "rating": 1,
        "text_review": "Does not work with VPN. I use duckduck go vpn to block advertising. Does not work with USB debugging enabled and developer mode. I am a developer, so i need both for my daily work. ALL OTHER UPI APP WORKS WITH ALL THREE SETTINGS ENABLED. Uninstalled. Very bad user experience.",
        "date": "2025-11-28 09:21:14"
    },
    {
        "user_name": "mohammed zaid",
        "rating": 1,
        "text_review": "even if you link your bank and give all permissions You CANNOT Invest IN US STOCK MARKET THEY WILL MAKE IT NECESSARY TO OPEN EITHER A FEDERAL BANK AC OR HDFC OR AXIS INDMONEY IS A SCAM AND LIERS",
        "date": "2025-11-28 00:46:25"
    },
    {
        "user_name": "Dr. Siddharth V Dagli",
        "rating": 1,
        "text_review": "Initially, there was a response when I opened my account. But after opening the account and purchasing couple of mutual funds, there is no response to my queries since then. the names of my nominee has been removed. email id, bank accts changed this is a matter of serious concern to me.it is impossible to dea with this organization. very unreliable unprofessional and incompetent. am helpless and stuck with them with no resolution. update 27.11.25 issue still unresolved!",
        "date": "2025-11-27 22:20:54"
    },
    {
        "user_name": "Yash Nuna",
        "rating": 1,
        "text_review": "INDmoney has the worst customer service Ive ever seen. My deposit has been stuck for 20 days, the app doesnt allow me to upload the bank statement, and even after sending screen recordings, they kept giving copypaste replies. No proper support, no resolution. Im closing my account and also closing two more family accounts that I had recommended earlier. If your money gets stuck here, good luck youll be on your own.",
        "date": "2025-11-27 11:42:01"
    },
    {
        "user_name": "Sarikul Sk",
        "rating": 1,
        "text_review": "Transfer failed today and show download leaste app i update leaste app but not working",
        "date": "2025-11-27 11:15:46"
    },
    {
        "user_name": "susha rani",
        "rating": 1,
        "text_review": "fraud app.eats your money with the bugs in it and no support executive to resolve the bug in app. pls do not use it.go for Zerodha",
        "date": "2025-11-27 00:24:25"
    },
    {
        "user_name": "Pramod kumar kar",
        "rating": 1,
        "text_review": "pathetic app. you will get 1000s of spam call for loan related. dont install this",
        "date": "2025-11-26 15:40:52"
    },
    {
        "user_name": "Ganesh Wackchoure",
        "rating": 1,
        "text_review": "I am trying to Open this app since from last morning but not opening, I am regularly using this app. I am not able to track my stock and Trade",
        "date": "2025-11-26 08:05:15"
    },
    {
        "user_name": "Ashish Sharma",
        "rating": 1,
        "text_review": "I was very satisfied and happy trading in ind money so I gave 5 star but now I would change to 1 star as their new update has made my trading experience horrible with ind money the loss which I havent incurred in trade is been shown in the PL statement and they say that this change is made for better view of the profit or loss incurred whether realised or unrealized thats disgusting",
        "date": "2025-11-26 00:48:20"
    },
    {
        "user_name": "Sai Sardesai",
        "rating": 1,
        "text_review": "God knows how people are rating this good, started investing here thinking it would be good but my experience is just getting worse. App has glitches, the UX is pathetic. Its just shiny app with fancy marketing I guess. The SIP features are so confusing and complicated. This product is made by too tech savvy idiots who dont care about customer satisfaction and usability Update After update this app is now even worse, I hit the buy button on any ticker and the app crashes",
        "date": "2025-11-25 18:59:53"
    },
    {
        "user_name": "Ashish Kumar",
        "rating": 1,
        "text_review": "never go for mobile recharge. it takes very long to resolve problem if it goes pending",
        "date": "2025-11-25 12:57:09"
    },
    {
        "user_name": "Kamlesh Kumar",
        "rating": 1,
        "text_review": "this app service is not good , After 22 minutes waiting for verification I feel totally waist of time... not recommend",
        "date": "2025-11-24 19:20:27"
    },
    {
        "user_name": "Sukanta Biswas",
        "rating": 1,
        "text_review": "UPI payment is kept on loading after newly added security checks.",
        "date": "2025-11-24 13:12:47"
    },
    {
        "user_name": "Sandip Banerjee",
        "rating": 1,
        "text_review": "Ind money othority customer service very froudly companies and deposit money know withdrawal know download any customer ind money application",
        "date": "2025-11-24 12:10:17"
    },
    {
        "user_name": "sunilkumar tammana",
        "rating": 1,
        "text_review": "I used the INDmoney app to complete a mobile recharge, but the recharge was not processed. It has been over 48 hours, and the status is still showing as pending. However, the amount has already been deducted from my account. I tried waiting, but nothing has been updated. This is very disappointing and inconvenient. Please resolve this issue as soon as possible and improve the recharge service worst app dont use this app my sincere request",
        "date": "2025-11-23 11:25:32"
    },
    {
        "user_name": "Rvin",
        "rating": 1,
        "text_review": "It calls my firewall a VPN, and refuses to verify phone number, citing some NPCI guidelines. All other UPI apps run fine on my phone except this. Lazy programming.",
        "date": "2025-11-22 00:22:31"
    },
    {
        "user_name": "Vishnu Paregi",
        "rating": 1,
        "text_review": "I could have made tons of profits if the communication was clear from your side. You failed as a broker. I should not have fallen into the trap of the 5 brokerage. I will not use INDmoney for trading purposes and I will advise the same to everyone. Other aspects MF, US, Tracking are great though.",
        "date": "2025-11-21 12:41:55"
    },
    {
        "user_name": "Ankita S",
        "rating": 1,
        "text_review": "we are not mad, trying to do kyc but everytime there is technical error you should improve the app. cant keep on trying for this.",
        "date": "2025-11-18 12:28:08"
    },
    {
        "user_name": "Raj Uddin",
        "rating": 1,
        "text_review": "unable to login kindly help me. The problem is all about my previous gmail account which is not available",
        "date": "2025-11-16 09:16:55"
    },
    {
        "user_name": "Roslin Babu",
        "rating": 1,
        "text_review": "Why my tracker only showing Bank? Where is EPF and EPS? Why my window is different from others. Updated, still not working.",
        "date": "2025-11-14 21:35:26"
    },
    {
        "user_name": "One time",
        "rating": 1,
        "text_review": "I am an old customer of Indmoney Money but I have to face some issues like KYC recording. I had kept my account closed for 12 months, so the option of deactivation is coming and when I clicked, the problem should have been solved in threefour days, at the most it has not been solved yet and the reactivation option is showing on the dashboard of Indmoney, it will be solved in 30 minutes, next 30 minutes, now 10 days are about to complete and the KYC problem is not solved yet.",
        "date": "2025-11-14 17:59:55"
    },
    {
        "user_name": "Anuj gupta",
        "rating": 1,
        "text_review": "if it is financial app why do you need to listen to audio my health data and access to photos and videos..",
        "date": "2025-11-12 23:11:57"
    },
    {
        "user_name": "Digvijay Kumar",
        "rating": 1,
        "text_review": "Downgraded, removed watchlist feature which used be earlier beside explore option.",
        "date": "2025-11-12 22:21:59"
    },
    {
        "user_name": "Kirtan Gandhi",
        "rating": 1,
        "text_review": "please give a clear xirr button... I cant find my xirr returns for stocks..",
        "date": "2025-11-12 18:17:14"
    },
    {
        "user_name": "Siddhartha Singh",
        "rating": 1,
        "text_review": "Analytic section is useless for etf right now, ETFs are counted as a single stock, so its hard to know what stocks Im indirectly holding through them. Showing the underlying stocks of ETFs would make the Analytics section much more useful and detailed.",
        "date": "2025-11-12 15:52:14"
    },
    {
        "user_name": "Rohit",
        "rating": 1,
        "text_review": "I dont know why now every other app force you to update , google is closing Openness that android have",
        "date": "2025-11-12 08:52:46"
    },
    {
        "user_name": "varalakshmi villa",
        "rating": 1,
        "text_review": "junk app and worst ever support team, just for sake of norms they update tickets without any helpful progress on actual issue. i want to give negative rating. They are still playing with customer deposit money without crediting to wallet, I have initiated deposit of 2L on 30Oct, till now it is not yet credited to my wallet, first they said 6Nov, now they are saying it will take upto 12Nov my tkt2852554, what are they doing with customers money? dont use this app for your investment plans",
        "date": "2025-11-11 13:03:30"
    },
    {
        "user_name": "Jyotishman Mech",
        "rating": 1,
        "text_review": "it been 6 days since request for withdrawal in the app it showing credit to your account but I didnt receive the money and I am trying to reach support but no luck",
        "date": "2025-11-11 10:35:40"
    },
    {
        "user_name": "Sudhakar K",
        "rating": 1,
        "text_review": "there is not even a feature to place a limit order",
        "date": "2025-11-08 13:10:12"
    },
    {
        "user_name": "akshat thakur",
        "rating": 1,
        "text_review": "worst ever experience with credit card bill payments, i made the payment and the app received the payment but it didnt submit it to my credit card instead it reverted my payment after one day when my due date was over, i was charged with penality just because the payment was failed by them. Will switch back to CRED now for making payments.",
        "date": "2025-11-08 10:27:11"
    },
    {
        "user_name": "Sidoos Gaming World",
        "rating": 1,
        "text_review": "The worst customer service. Raised multiple tickets about 20 Days ago and still no response. Zerodha is Coming up with US investing in next Quarter. Thank you for the awesome service.",
        "date": "2025-11-08 10:00:20"
    },
    {
        "user_name": "Suraj Shinde",
        "rating": 1,
        "text_review": "never book FD and never accept problem solution from customer support",
        "date": "2025-11-07 21:38:45"
    },
    {
        "user_name": "Tuhin Sardar",
        "rating": 1,
        "text_review": "This app Upi anymore not working and service is unavailable. This app upi customer team not working this problem.Use Groww app all featured available Stock, Mutual Fund, Bond, ETF, MTF,IPO, FD, UPI Loan.",
        "date": "2025-11-07 00:07:37"
    },
    {
        "user_name": "Karan Dole",
        "rating": 1,
        "text_review": "mera is app me account belence mein Chala Gaya 170 ho gaya",
        "date": "2025-11-06 15:43:21"
    },
    {
        "user_name": "AMIT RK MAHTO",
        "rating": 1,
        "text_review": "I have blocked the account and deleted it forever. This app is very nonsense. The demat account so far is poor because it has more broker charges. There is no call in the helpline number.",
        "date": "2025-11-05 13:15:38"
    },
    {
        "user_name": "RSquare Patra",
        "rating": 1,
        "text_review": "I have already registered, still I have to repeat the registration process again, when I open the later on",
        "date": "2025-11-05 07:49:16"
    },
    {
        "user_name": "Nimal Jayaprakash",
        "rating": 1,
        "text_review": "Do you have a support mechanism. Your FAQs do not help sort the issues. you seem to trick your customers if you do not have answers to the queries.",
        "date": "2025-11-04 20:55:06"
    },
    {
        "user_name": "Brice dmello",
        "rating": 1,
        "text_review": "Is this app really reliable. Are the charts accurate? No more a good app to invest.",
        "date": "2025-11-03 10:20:25"
    },
    {
        "user_name": "Kingsly",
        "rating": 1,
        "text_review": "It has been nearly a month i put withdrawl from us wallet still i didnt received my amount how many times should my complaint about this Due to operational constraints means you should rectify that and give the solution as soon as possible but yoh are using that as a reason and delaying day by day its not even a big amount too while investing you said withdrawl will take upto mazximum of 57 days now it has been 25 days still i didnt received money i dont even know you are seeing your cuatomer",
        "date": "2025-11-03 09:45:28"
    },
    {
        "user_name": "Gourab Banerjee",
        "rating": 1,
        "text_review": "I have been waiting for the activation of my account and trying to get in touch with an agent. It is showing that the agent is supposed call me in 2 mins which turns out to be 15 mins after a minute. but I dont get any communication regarding the same. I have sent numerous emails but nothing has been communicated.",
        "date": "2025-11-02 21:13:01"
    },
    {
        "user_name": "MD AARIF",
        "rating": 1,
        "text_review": "my account is suddenly blocked or frozen my account balance not use or complaint karne ke bad bhi koi response nhi mila very bad service",
        "date": "2025-11-02 11:52:21"
    },
    {
        "user_name": "彡 Eᴀꜱᴡᴇʀ 彡",
        "rating": 1,
        "text_review": "why there only federal bank or hdfc or axis. THT SHOULD BE ANY BANK.not a good app, i want to close my account",
        "date": "2025-10-31 18:35:07"
    },
    {
        "user_name": "Anmol Puranik",
        "rating": 1,
        "text_review": "Forcefully liquidated my ETFs. As per IFSCA circular it only restricts providers from offering these products like Bitcoin ETFs, but does not mention a requirement for existing holders to sell or liquidate their assets if already bought before the circular was shared. INDMoney forcefully sold without my confirmation. This is a breach in customer service.",
        "date": "2025-10-31 17:30:29"
    },
    {
        "user_name": "Sri Harsha",
        "rating": 1,
        "text_review": "The app and interface is pretty good. I used to use et money earlier but now I feel it has become cluttered. The only issue for me is that im not able to edit my SIP since one month. Its always showing coming soon. As a result im compelled to move to et money again. Hope you fix it. Till then 1 star.",
        "date": "2025-10-31 09:26:14"
    },
    {
        "user_name": "Nitin Pande",
        "rating": 1,
        "text_review": "Such an invasive app. Keeps trying to read your emails, credit cards and everything else...for an app marketed for stocks and mutual funds. Interface is designed in such a way that it is very difficult to deny it these permissions. It keeps asking for it, and in different ways making it so difficult. Despite being so careful during set up including unchecking boxes, it still got access to my gmail and got access to my credit card information. I had to go back and manually remove everything.",
        "date": "2025-10-31 07:30:32"
    },
    {
        "user_name": "Sunny Vishwakarma",
        "rating": 1,
        "text_review": "apps is not supporting in my device moto 4 e plus please respond me",
        "date": "2025-10-30 22:22:57"
    },
    {
        "user_name": "Yummy food Shorts",
        "rating": 1,
        "text_review": "please fix upi glitc and every thing is good..but please fix upi payment glitch",
        "date": "2025-10-30 18:06:13"
    },
    {
        "user_name": "Paras Savla",
        "rating": 1,
        "text_review": "WhatsApp cant withdraw balance only forces you to open federal bank account",
        "date": "2025-10-30 11:13:07"
    },
    {
        "user_name": "Vishu Mandy",
        "rating": 1,
        "text_review": "worst trading app , do not do trading in this app, its withdrawal system is way pathetic, its a scam which they do with traders",
        "date": "2025-10-30 11:02:20"
    },
    {
        "user_name": "Aaron Lobo",
        "rating": 2,
        "text_review": "I cannot access the app from my tablet. I can only access it from my phone",
        "date": "2025-11-28 01:07:56"
    },
    {
        "user_name": "Sashank Barua",
        "rating": 2,
        "text_review": "why did the monthly SIP dashboard was suddenly take down",
        "date": "2025-11-08 02:26:53"
    },
    {
        "user_name": "Prakash Kumar Singh",
        "rating": 2,
        "text_review": "Pros 1. Best user interface for options trading. 2. Us stocks buying feature. 3. Mind feature king of the features. Cons 1. Trading views chart missing in flash mode. 2. Option chain windows takes lot of space in web mode. Solution could be auto hide or manual hide feature in web mode 3. Advanced option chain option should be provided such as dhan, upstox. For other greeks 4. Paper trading feature or bactesting feature missing. 5. App crash so frequent.",
        "date": "2025-11-03 23:28:15"
    },
    {
        "user_name": "Joshua",
        "rating": 2,
        "text_review": "Us stock adding money conversion charges are very high compared to Real exchange rate. Add option to add via UPI or Forex Cards or Credit cards people have Many cards that are zero forex charges.",
        "date": "2025-11-02 23:46:11"
    },
    {
        "user_name": "Sagar Vaish",
        "rating": 2,
        "text_review": "indicator settings get deleted automatically..all charts indicator gets reset.. and out of nowhere it shows random saved preset which I didnt save or applied.",
        "date": "2025-10-31 12:50:31"
    },
    {
        "user_name": "Tony Stark",
        "rating": 2,
        "text_review": "NEW ISSUE AUG2025 why bank transaction time showing as AEDT, insteed of IST ? For UPI scan also its asking for password after that also i shows some error we have to force close to scan again. Wow more details in Analysis now, please add seperate card for tax saving funds. Please reinstate it or adopt Growws approach. Also, EPFO tracking needs improvementmany users at HCL, TCS, Infosys, etc., use private PF trusts. Else, Add manual entry like Artos. Add support to Wifi android tablets.",
        "date": "2025-10-29 23:43:11"
    },
    {
        "user_name": "Abhishek Goyal",
        "rating": 2,
        "text_review": "no market depth is there is, when we select securities, unable to see buy sell activity , overall immature app makers , difficult fir trading, the app is ok for newbies , for expirience trader like me it wastage of time",
        "date": "2025-10-27 07:53:29"
    },
    {
        "user_name": "Aseem Kumar",
        "rating": 2,
        "text_review": "It asks for phone number, name as per PAN card, etc. May be even imposes its products, monitoring, etc. Refused to complete sign up. Uninstalled.",
        "date": "2025-10-24 18:41:56"
    },
    {
        "user_name": "Rishabh Kumar",
        "rating": 2,
        "text_review": "I admire and enjoy the indian stock trading experience. but the US one is unusable for trading by its design. the maxed out brokerage charges that is not based upon no. of stocks one buys. The max cap of 25 is insane for indian traders. it will drink up all returns. If the app just fixes this plus with some more high interest FD options from SFBs it could be the ideal money management app. these things are limiting the app to become market leader.",
        "date": "2025-10-23 21:05:29"
    },
    {
        "user_name": "Bhushan Chinchmalatpure",
        "rating": 2,
        "text_review": "App doesnt work with BSNL 4G EVEN though speed is 40 mbps. app shows message you are on malicious network. Please do the needful. look is fresh, Clear UI forced me to stay with this app",
        "date": "2025-10-21 23:39:38"
    },
    {
        "user_name": "Puman Wangsu",
        "rating": 2,
        "text_review": "after updated the app stuck not smooth i want old version",
        "date": "2025-10-20 12:39:21"
    },
    {
        "user_name": "아비 아드웨이트",
        "rating": 2,
        "text_review": "Indmony mobile number update too difficult. 6 months waiting time too much longer so, sorry to say that Im close demat trading account Indmony but Im happy with motilal oswal demat account service now i trade in us stocks.",
        "date": "2025-10-15 07:30:32"
    },
    {
        "user_name": "KAPIL BHANDARI",
        "rating": 2,
        "text_review": "very sad no option for students to create federal saving account for us stock investment. there should be option for students",
        "date": "2025-10-14 08:25:01"
    },
    {
        "user_name": "amit kumar",
        "rating": 2,
        "text_review": "KINDLY read carefully Feedback .......... Sir, please bring your short UPI ID, implement next generation technology and AI tools. Employ worldclass professionals.Provide investment services through debit cards, RBI listed wallets, prepaid cards, credit cards etc.",
        "date": "2025-10-13 00:19:49"
    },
    {
        "user_name": "Abhishek Singh",
        "rating": 2,
        "text_review": "i forget my previous mobile no. i cant login on app can you help me to login with email id because email id was same that time",
        "date": "2025-09-28 19:49:34"
    },
    {
        "user_name": "Arif Warsi Laskar",
        "rating": 2,
        "text_review": "Why can I not add the fund in a basket from my portfolio ? Every time I need to buy multiple MF units, I have to go one by one. This is a very common feature of every trading app, and also convenient. I wrote the complaint about it and a customer care executive gave the solution that I can use the MF basket from the app, but there everything is predefined. Even though I can change the MF, but I cant change the percentage or add a new fund. You can consider adding this feature.",
        "date": "2025-09-28 11:23:37"
    },
    {
        "user_name": "Supriya Metiya",
        "rating": 2,
        "text_review": "good platform but i find one bad ux problem in slide option to increase or decrease money, it would be better if we just write the amount",
        "date": "2025-09-25 16:41:52"
    },
    {
        "user_name": "HM MANAS",
        "rating": 2,
        "text_review": "App is good and smooth..but it has very high trading, delivery, mtf and other hidden charges",
        "date": "2025-09-25 10:32:46"
    },
    {
        "user_name": "prajeesh karayil",
        "rating": 2,
        "text_review": "Interface wise this app is good, but the number of times the app was unable to open. showing an error message like your device is rooted. This app will not work. without proper testing they are pushing the app to the play store. In another scenario place buy order button is enabled even without sufficient fund. Today 19092025 app not loading the flash mode its showing a blank page, also If we configured any SL or Target we have to cancel that before selling.So I am not recommended forFO",
        "date": "2025-09-19 09:57:02"
    },
    {
        "user_name": "Sam",
        "rating": 2,
        "text_review": "Im not able to edit my mutual fund it just shows edit option as coming soon its so frustrating. how can i manage my SIP once i set it?",
        "date": "2025-09-19 09:49:25"
    },
    {
        "user_name": "Himanshu Jain",
        "rating": 2,
        "text_review": "Ind money is far inferior tech wise than its competitors. After using this for a while i know that they need to invest a lot in their tech if they really want to capture the market.. their thoughts can be seen but execution is lacks precision. Us stocks dont have candle charts, sorting feature for portfolio not available, fees is hidden somewhere so that u cant find it easily. 1 week chart has 8 days.. so they are bloating app with features but no one is testing it..",
        "date": "2025-09-11 02:08:49"
    },
    {
        "user_name": "Rajesh Sahoo",
        "rating": 2,
        "text_review": "why there is no dedicated customer care number. I am facing problem to resolve my issue and i cant contact directly and investing my hard earned money with you. what is the trust. ok you have a help center where we can raise tickets then somebody will contact us but there is no way to reach your team directly from my side. what if no body replies on that ticket? App is good but not getting that trust",
        "date": "2025-09-08 17:09:14"
    },
    {
        "user_name": "Bhudipta Bhatta",
        "rating": 2,
        "text_review": "Required more Options for FD AAA Rated of all Stable Bonds by this application of Platform. Then it will be more believed more popular all over Indian Customers.",
        "date": "2025-09-03 17:31:11"
    },
    {
        "user_name": "Arun AJ",
        "rating": 2,
        "text_review": "Show actual invested and current amount as a whole instead of rounded figures.",
        "date": "2025-08-31 22:40:41"
    },
    {
        "user_name": "Sankar Roy",
        "rating": 2,
        "text_review": "What the hell! Has happened to this app with the update. Now the app is not showing proper Net Profit and Loss properly, what was easy to check, previously.",
        "date": "2025-08-30 12:11:08"
    },
    {
        "user_name": "Indra Kumar",
        "rating": 3,
        "text_review": "Mutual fund showing the absolute rate which is not correct for SIP investment, it should show the XIRR returns, which is the correct way to check our investment returns, When we see our portfolio it can see only absolute returns not able to find we are investing correct way",
        "date": "2025-11-28 02:06:59"
    },
    {
        "user_name": "Vishal Official",
        "rating": 3,
        "text_review": "A very important update is needed in the app For any order weve placed, the current price of that stock or option should be visible in the Orders tab. This helps us track the price fluctuations and decide whether to cancel the order or let it execute.Also, if we cancel an order, there should be a Reorder option so we can place the same order again easily.",
        "date": "2025-11-26 14:46:02"
    },
    {
        "user_name": "Niraj Bhatt",
        "rating": 3,
        "text_review": "please use full names instead of first name and last name for nominees as most government IDs use full names. please sort assets in descending order of value in the main myIND page. INDpay UPI ID exposes our phone numbers, and there is no option to change it!",
        "date": "2025-11-26 12:48:19"
    },
    {
        "user_name": "ಸಮರ್",
        "rating": 3,
        "text_review": "Add in mutual funds fortnightly payment options feature in mutual fund section in next update for better convenience.",
        "date": "2025-11-26 11:25:51"
    },
    {
        "user_name": "Chetan Morey",
        "rating": 3,
        "text_review": "I am reducing my rating from 4 to 3 stars. In the recent software update they have removed the sort filter option from the watchlist. How do I monitor all my ETFs? Ind money why remove essential basic features? Please restore the original watchlist, which had sort by return, filter, current price 1 days return. Apart from that the overall app experience is good. I recommend this app for managing wealth.",
        "date": "2025-11-23 13:37:27"
    },
    {
        "user_name": "fathimathul zohara",
        "rating": 3,
        "text_review": "I need to change my number and add another account but there is no option there, I cant even delete my account to log in again with another number. What am I supposed to do now?",
        "date": "2025-11-21 11:23:04"
    },
    {
        "user_name": "Arvind Kumar",
        "rating": 3,
        "text_review": "us trading Federal bank KYC is Very Difficult many I many time trying please improve this.",
        "date": "2025-11-20 12:17:13"
    },
    {
        "user_name": "Veeresh Shivarudraiah",
        "rating": 3,
        "text_review": "need more instruments on chart reading in F and O",
        "date": "2025-11-14 07:46:09"
    },
    {
        "user_name": "R Mawlong",
        "rating": 3,
        "text_review": "there is an issue in doing vkyc from the app, in relation to echoing audio, all the time i have initiate the vkyc and not successful, i have not experience any issue with vkyc that are done through chrome browser, i dont if the problem is with the phone or from the app",
        "date": "2025-11-09 08:58:34"
    },
    {
        "user_name": "Deep Shah",
        "rating": 3,
        "text_review": "Huge charges, exchange rates are higher plus bank charges you additional on exchange rates Average 25 are gone in charges only Hurdle to initiate investments",
        "date": "2025-11-08 19:53:51"
    },
    {
        "user_name": "SRT",
        "rating": 3,
        "text_review": "Need to track Lic policy ..when this feature will be added?",
        "date": "2025-11-04 00:17:50"
    },
    {
        "user_name": "Swarnadeep Basak",
        "rating": 3,
        "text_review": "Please add APY, LIC tracking as soon as possible and in PPF tracking section, recurring deposit start date is fixed for today but it should be flexible for future dates too like end date. Fix these issues immediately, it will help tracking easier and effective.",
        "date": "2025-11-03 23:54:35"
    },
    {
        "user_name": "Darshanesh Patil",
        "rating": 3,
        "text_review": "There is a need of improvement in various sections of the app which will make the app even better 1 Quick easy tax filing with consultation 2 US and Indian stock custom bucket portfolio creation optionsimilar to smallcase 3 Just like Mutual funds What if I redeem today it should also be available for Indian Stocks 4 Digital gold investment",
        "date": "2025-11-02 21:48:54"
    },
    {
        "user_name": "raghav seth",
        "rating": 3,
        "text_review": "earlier used to show xirr on US stocks portfolio, now why you have stopped?",
        "date": "2025-10-31 20:16:15"
    },
    {
        "user_name": "L Aman",
        "rating": 3,
        "text_review": "Man I have a complaint I try to order something from Flipkart and I did sent my upi id to flipkart to make payment but in my indmoney app there are no notification about sending money I cant order any thing from it help , its not like my money is debit",
        "date": "2025-10-31 10:51:27"
    },
    {
        "user_name": "Aakash S",
        "rating": 3,
        "text_review": "Ill admit, INDmoney has a really attractive and userfriendly interface its easy to navigate and visually appealing. But what really disappointed me is their claim of no hidden charges. After comparing with Groww, I realized INDmoney adds several hidden fees that arent clearly disclosed upfront. The DP charges and other costs eat into profits, especially for small trades. Its frustrating and feels misleading. Great design, but poor transparency. Not a good experience overall.",
        "date": "2025-10-27 12:25:54"
    },
    {
        "user_name": "Sauronil “Alhaitham” Joy",
        "rating": 3,
        "text_review": "The headlines r mostly FOMO inducing or completely Fear Mongering like the rule 10b 5 CEO Sell is always highlighted as Future Uncertainty for a company and Sign as a collapse, whereas reality is completely nuanced and is nothing to be worried about, that is a normal part of the process. Without the alert and headline part, this is actually a grt app. I need real and nuanced headline, if not, please give me an option to disable them, Thank you.",
        "date": "2025-10-23 11:41:18"
    },
    {
        "user_name": "Subham Seal",
        "rating": 3,
        "text_review": "I dont know why they stopped showing CAGR for US stocks. Also same problem for Indian stocks. Please ask your developers to redeploy these features.",
        "date": "2025-10-15 03:38:22"
    },
    {
        "user_name": "Krishna Pani",
        "rating": 3,
        "text_review": "can u please tell me how can I track my lic investment on ind money",
        "date": "2025-10-13 22:11:42"
    },
    {
        "user_name": "Md Amin",
        "rating": 3,
        "text_review": "it makes learning interesting and has the capability to replace reels",
        "date": "2025-10-12 11:49:52"
    },
    {
        "user_name": "Kislay Kumar",
        "rating": 3,
        "text_review": "DTH recharge stuck while billing and amount deducted... Sometimes the NPS investment shows unrealistic figure Edit1 DTH recharge failed still persist Edit2 NPS amount not updating since last 3 months",
        "date": "2025-10-07 10:28:16"
    },
    {
        "user_name": "Nadeem SLF",
        "rating": 3,
        "text_review": "brokerage of 10 rs per trade is enough. dont u have option of zero brokerage. with annual plan",
        "date": "2025-10-07 06:17:48"
    },
    {
        "user_name": "RamprasadAviator",
        "rating": 3,
        "text_review": "Lot of Pop up and Distractions in the UI ., you should improve Dashboard layout and overall app design without marketing popup or distractions. it should me informative and easy to use.",
        "date": "2025-10-07 00:11:52"
    },
    {
        "user_name": "SRI KRISHNA KONIDALA JAYARAM",
        "rating": 3,
        "text_review": "not a investor friendly ideas found in this app and operations.",
        "date": "2025-10-06 14:25:42"
    },
    {
        "user_name": "praveenkumar talawar",
        "rating": 3,
        "text_review": "need suggestions on stocks and tools analyze stocks so that we invest",
        "date": "2025-10-04 20:42:02"
    },
    {
        "user_name": "Vijay Ponangi",
        "rating": 3,
        "text_review": "good finance tracking app.Need to add insurance, physical gold silver assets tracking physical real estate tracking.",
        "date": "2025-10-03 21:38:32"
    },
    {
        "user_name": "Sachin",
        "rating": 3,
        "text_review": "When will be allowed to sell new IPOs and listings at 935 AM or 945 AM? It always says to wait till 10 AM",
        "date": "2025-09-29 22:26:33"
    },
    {
        "user_name": "Mukul Gupta",
        "rating": 3,
        "text_review": "Please optimise app for Samsung Fold 7. Currently the app is horrible to use on the full screen of Fold7 but it could be so much better. I hope the devs will fix this ASAP.",
        "date": "2025-09-26 17:17:03"
    },
    {
        "user_name": "Debasish",
        "rating": 3,
        "text_review": "super app advance chart prediction for options Trading is very very helpful relly love it.. But system works slow delay to opening charts order execute and Complex app",
        "date": "2025-09-24 14:53:09"
    },
    {
        "user_name": "HARMEET SINGH",
        "rating": 3,
        "text_review": "They only support UPI as a payment method to buy new funds. Before, there were multiple options to choose",
        "date": "2025-09-21 00:01:52"
    },
    {
        "user_name": "Ayush Salampuriya",
        "rating": 3,
        "text_review": "good app but still international stockindex prices are delayed by 15 minutes which is not at all understandable!! like gift nifty, nasdaq and other major indices pricing are delayed. if you are providing us stock buysell, then this is expected from indmoney!!",
        "date": "2025-09-17 23:40:14"
    },
    {
        "user_name": "Aritra Ghosh",
        "rating": 3,
        "text_review": "Great app. Also high time for a Dark mode now. Try to keep the calculations more accurate, for a finance app.",
        "date": "2025-09-17 07:09:46"
    },
    {
        "user_name": "Deependra Pratap Singh",
        "rating": 3,
        "text_review": "allow any bank in name and linked to mobile number for sip upi auto pay like Paytm money. one mandate setup and link various sip .",
        "date": "2025-09-14 14:33:39"
    },
    {
        "user_name": "Sweta Gupta",
        "rating": 3,
        "text_review": "NPS can only be added if you have Google account added to it. Why this is so? does not make sense.",
        "date": "2025-09-14 10:09:41"
    },
    {
        "user_name": "PRIYANSHU MISHRA",
        "rating": 3,
        "text_review": "make your separate upi app ..its messy in one app",
        "date": "2025-09-10 21:09:51"
    },
    {
        "user_name": "sumit pant",
        "rating": 3,
        "text_review": "its early days since I have started using the app, however one feature I found issue with is that after closing the app, if one opens again then sometimes it opens without asking for password, which is not ok, almost all fintech apps that I uses ask for password the moment the screen is left idle for over a min or so. thus would request to check this out",
        "date": "2025-09-09 06:39:09"
    },
    {
        "user_name": "Sparsh Ahuja",
        "rating": 3,
        "text_review": "The date of the transaction in the mutual fund is difficult to understand.",
        "date": "2025-09-08 11:13:30"
    },
    {
        "user_name": "Sterrysh",
        "rating": 3,
        "text_review": "Let us see both realized and unrealised gains. I dont understand why you did that.",
        "date": "2025-09-02 13:22:04"
    },
    {
        "user_name": "Karthik Rao",
        "rating": 3,
        "text_review": "I have been using this app for more than a year. Its mostly good until you hit a snag with the app. Once you do you are screwed. Their customer support is fast but absolutely useless. Theyll never accept any issue at their end. Especially in the bill payment side. Happened on multiple occasions. Thoroughly disappointed. I need to find a better app to switch out to.",
        "date": "2025-08-21 12:59:29"
    },
    {
        "user_name": "Manas Goswami",
        "rating": 3,
        "text_review": "Good app but not great. It can not generate integrated view of family dashboard. I only want to see integrated view of all assets but its mandatory to open invest dmat account etc without any purpose. Please improve. Also only absolute returns are shown not XIRR also no option to change XIRR as default. In other apps like kuvera its not Mandatory to open dmat and I can see integrated view of family investment.",
        "date": "2025-08-18 01:21:37"
    }
]