[
    {
        "user_name": "suresh Arone",
        "rating": 1,
        "text_review": "please stop sending frequently whats app messages, mail, Loan promotion, insurance promo, credit payment reminder, its to much irritating. I know to pay my bill you dont remind. please stop after I have block you guys. still your sending every day. stop it",
        "date": "2025-11-29 15:27:22"
    },
    {
        "user_name": "Yåsh kumar",
        "rating": 1,
        "text_review": "1MUST give MTFs for US Stocks 2FUTURES OPTIONS for Commodity MARKET 3 FUTURES OPTIONS for US STOCKS",
        "date": "2025-11-29 12:00:34"
    },
    {
        "user_name": "Bhupesh Pranami",
        "rating": 1,
        "text_review": "Does not work with VPN. I use duckduck go vpn to block advertising. Does not work with USB debugging enabled and developer mode. I am a developer, so i need both for my daily work. ALL OTHER UPI APP WORKS WITH ALL THREE SETTINGS ENABLED. Uninstalled. Very bad user experience.",
        "date": "2025-11-28 09:21:14"
    },
    {
        "user_name": "mohammed zaid",
        "rating": 1,
        "text_review": "even if you link your bank and give all permissions You CANNOT Invest IN US STOCK MARKET THEY WILL MAKE IT NECESSARY TO OPEN EITHER A FEDERAL BANK AC OR HDFC OR AXIS INDMONEY IS A SCAM AND LIERS",
        "date": "2025-11-28 00:46:25"
    },
    {
        "user_name": "Dr. Siddharth V Dagli",
        "rating": 1,
        "text_review": "Initially, there was a response when I opened my account. But after opening the account and purchasing couple of mutual funds, there is no response to my queries since then. the names of my nominee has been removed. email id, bank accts changed this is a matter of serious concern to me.it is impossible to dea with this organization. very unreliable unprofessional and incompetent. am helpless and stuck with them with no resolution. update 27.11.25 issue still unresolved!",
        "date": "2025-11-27 22:20:54"
    },
    {
        "user_name": "Yash Nuna",
        "rating": 1,
        "text_review": "INDmoney has the worst customer service Ive ever seen. My deposit has been stuck for 20 days, the app doesnt allow me to upload the bank statement, and even after sending screen recordings, they kept giving copypaste replies. No proper support, no resolution. Im closing my account and also closing two more family accounts that I had recommended earlier. If your money gets stuck here, good luck youll be on your own.",
        "date": "2025-11-27 11:42:01"
    },
    {
        "user_name": "Sarikul Sk",
        "rating": 1,
        "text_review": "Transfer failed today and show download leaste app i update leaste app but not working",
        "date": "2025-11-27 11:15:46"
    },
    {
        "user_name": "susha rani",
        "rating": 1,
        "text_review": "fraud app.eats your money with the bugs in it and no support executive to resolve the bug in app. pls do not use it.go for Zerodha",
        "date": "2025-11-27 00:24:25"
    },
    {
        "user_name": "Pramod kumar kar",
        "rating": 1,
        "text_review": "pathetic app. you will get 1000s of spam call for loan related. dont install this",
        "date": "2025-11-26 15:40:52"
    },
    {
        "user_name": "Ganesh Wackchoure",
        "rating": 1,
        "text_review": "I am trying to Open this app since from last morning but not opening, I am regularly using this app. I am not able to track my stock and Trade",
        "date": "2025-11-26 08:05:15"
    },
    {
        "user_name": "Ashish Sharma",
        "rating": 1,
        "text_review": "I was very satisfied and happy trading in ind money so I gave 5 star but now I would change to 1 star as their new update has made my trading experience horrible with ind money the loss which I havent incurred in trade is been shown in the PL statement and they say that this change is made for better view of the profit or loss incurred whether realised or unrealized thats disgusting",
        "date": "2025-11-26 00:48:20"
    },
    {
        "user_name": "Sai Sardesai",
        "rating": 1,
        "text_review": "God knows how people are rating this good, started investing here thinking it would be good but my experience is just getting worse. App has glitches, the UX is pathetic. Its just shiny app with fancy marketing I guess. The SIP features are so confusing and complicated. This product is made by too tech savvy idiots who dont care about customer satisfaction and usability Update After update this app is now even worse, I hit the buy button on any ticker and the app crashes",
        "date": "2025-11-25 18:59:53"
    },
    {
        "user_name": "Ashish Kumar",
        "rating": 1,
        "text_review": "never go for mobile recharge. it takes very long to resolve problem if it goes pending",
        "date": "2025-11-25 12:57:09"
    },
    {
        "user_name": "Kamlesh Kumar",
        "rating": 1,
        "text_review": "this app service is not good , After 22 minutes waiting for verification I feel totally waist of time... not recommend",
        "date": "2025-11-24 19:20:27"
    },
    {
        "user_name": "Sukanta Biswas",
        "rating": 1,
        "text_review": "UPI payment is kept on loading after newly added security checks.",
        "date": "2025-11-24 13:12:47"
    },
    {
        "user_name": "Sandip Banerjee",
        "rating": 1,
        "text_review": "Ind money othority customer service very froudly companies and deposit money know withdrawal know download any customer ind money application",
        "date": "2025-11-24 12:10:17"
    },
    {
        "user_name": "sunilkumar tammana",
        "rating": 1,
        "text_review": "I used the INDmoney app to complete a mobile recharge, but the recharge was not processed. It has been over 48 hours, and the status is still showing as pending. However, the amount has already been deducted from my account. I tried waiting, but nothing has been updated. This is very disappointing and inconvenient. Please resolve this issue as soon as possible and improve the recharge service worst app dont use this app my sincere request",
        "date": "2025-11-23 11:25:32"
    },
    {
        "user_name": "Rvin",
        "rating": 1,
        "text_review": "It calls my firewall a VPN, and refuses to verify phone number, citing some NPCI guidelines. All other UPI apps run fine on my phone except this. Lazy programming.",
        "date": "2025-11-22 00:22:31"
    },
    {
        "user_name": "Vishnu Paregi",
        "rating": 1,
        "text_review": "I could have made tons of profits if the communication was clear from your side. You failed as a broker. I should not have fallen into the trap of the 5 brokerage. I will not use INDmoney for trading purposes and I will advise the same to everyone. Other aspects MF, US, Tracking are great though.",
        "date": "2025-11-21 12:41:55"
    },
    {
        "user_name": "Ankita S",
        "rating": 1,
        "text_review": "we are not mad, trying to do kyc but everytime there is technical error you should improve the app. cant keep on trying for this.",
        "date": "2025-11-18 12:28:08"
    },
    {
        "user_name": "Raj Uddin",
        "rating": 1,
        "text_review": "unable to login kindly help me. The problem is all about my previous gmail account which is not available",
        "date": "2025-11-16 09:16:55"
    },
    {
        "user_name": "Roslin Babu",
        "rating": 1,
        "text_review": "Why my tracker only showing Bank? Where is EPF and EPS? Why my window is different from others. Updated, still not working.",
        "date": "2025-11-14 21:35:26"
    },
    {
        "user_name": "One time",
        "rating": 1,
        "text_review": "I am an old customer of Indmoney Money but I have to face some issues like KYC recording. I had kept my account closed for 12 months, so the option of deactivation is coming and when I clicked, the problem should have been solved in threefour days, at the most it has not been solved yet and the reactivation option is showing on the dashboard of Indmoney, it will be solved in 30 minutes, next 30 minutes, now 10 days are about to complete and the KYC problem is not solved yet.",
        "date": "2025-11-14 17:59:55"
    },
    {
        "user_name": "Anuj gupta",
        "rating": 1,
        "text_review": "if it is financial app why do you need to listen to audio my health data and access to photos and videos..",
        "date": "2025-11-12 23:11:57"
    },
    {
        "user_name": "Digvijay Kumar",
        "rating": 1,
        "text_review": "Downgraded, removed watchlist feature which used be earlier beside explore option.",
        "date": "2025-11-12 22:21:59"
    },
    {
        "user_name": "Kirtan Gandhi",
        "rating": 1,
        "text_review": "please give a clear xirr button... I cant find my xirr returns for stocks..",
        "date": "2025-11-12 18:17:14"
    },
    {
        "user_name": "Siddhartha Singh",
        "rating": 1,
        "text_review": "Analytic section is useless for etf right now, ETFs are counted as a single stock, so its hard to know what stocks Im indirectly holding through them. Showing the underlying stocks of ETFs would make the Analytics section much more useful and detailed.",
        "date": "2025-11-12 15:52:14"
    },
    {
        "user_name": "Rohit",
        "rating": 1,
        "text_review": "I dont know why now every other app force you to update , google is closing Openness that android have",
        "date": "2025-11-12 08:52:46"
    },
    {
        "user_name": "varalakshmi villa",
        "rating": 1,
        "text_review": "junk app and worst ever support team, just for sake of norms they update tickets without any helpful progress on actual issue. i want to give negative rating. They are still playing with customer deposit money without crediting to wallet, I have initiated deposit of 2L on 30Oct, till now it is not yet credited to my wallet, first they said 6Nov, now they are saying it will take upto 12Nov my tkt2852554, what are they doing with customers money? dont use this app for your investment plans",
        "date": "2025-11-11 13:03:30"
    },
    {
        "user_name": "Jyotishman Mech",
        "rating": 1,
        "text_review": "it been 6 days since request for withdrawal in the app it showing credit to your account but I didnt receive the money and I am trying to reach support but no luck",
        "date": "2025-11-11 10:35:40"
    },
    {
        "user_name": "Sudhakar K",
        "rating": 1,
        "text_review": "there is not even a feature to place a limit order",
        "date": "2025-11-08 13:10:12"
    },
    {
        "user_name": "akshat thakur",
        "rating": 1,
        "text_review": "worst ever experience with credit card bill payments, i made the payment and the app received the payment but it didnt submit it to my credit card instead it reverted my payment after one day when my due date was over, i was charged with penality just because the payment was failed by them. Will switch back to CRED now for making payments.",
        "date": "2025-11-08 10:27:11"
    },
    {
        "user_name": "Sidoos Gaming World",
        "rating": 1,
        "text_review": "The worst customer service. Raised multiple tickets about 20 Days ago and still no response. Zerodha is Coming up with US investing in next Quarter. Thank you for the awesome service.",
        "date": "2025-11-08 10:00:20"
    },
    {
        "user_name": "Suraj Shinde",
        "rating": 1,
        "text_review": "never book FD and never accept problem solution from customer support",
        "date": "2025-11-07 21:38:45"
    },
    {
        "user_name": "Tuhin Sardar",
        "rating": 1,
        "text_review": "This app Upi anymore not working and service is unavailable. This app upi customer team not working this problem.Use Groww app all featured available Stock, Mutual Fund, Bond, ETF, MTF,IPO, FD, UPI Loan.",
        "date": "2025-11-07 00:07:37"
    },
    {
        "user_name": "Karan Dole",
        "rating": 1,
        "text_review": "mera is app me account belence mein Chala Gaya 170 ho gaya",
        "date": "2025-11-06 15:43:21"
    },
    {
        "user_name": "AMIT RK MAHTO",
        "rating": 1,
        "text_review": "I have blocked the account and deleted it forever. This app is very nonsense. The demat account so far is poor because it has more broker charges. There is no call in the helpline number.",
        "date": "2025-11-05 13:15:38"
    },
    {
        "user_name": "RSquare Patra",
        "rating": 1,
        "text_review": "I have already registered, still I have to repeat the registration process again, when I open the later on",
        "date": "2025-11-05 07:49:16"
    },
    {
        "user_name": "Nimal Jayaprakash",
        "rating": 1,
        "text_review": "Do you have a support mechanism. Your FAQs do not help sort the issues. you seem to trick your customers if you do not have answers to the queries.",
        "date": "2025-11-04 20:55:06"
    },
    {
        "user_name": "Brice dmello",
        "rating": 1,
        "text_review": "Is this app really reliable. Are the charts accurate? No more a good app to invest.",
        "date": "2025-11-03 10:20:25"
    },
    {
        "user_name": "Kingsly",
        "rating": 1,
        "text_review": "It has been nearly a month i put withdrawl from us wallet still i didnt received my amount how many times should my complaint about this Due to operational constraints means you should rectify that and give the solution as soon as possible but yoh are using that as a reason and delaying day by day its not even a big amount too while investing you said withdrawl will take upto mazximum of 57 days now it has been 25 days still i didnt received money i dont even know you are seeing your cuatomer",
        "date": "2025-11-03 09:45:28"
    },
    {
        "user_name": "Gourab Banerjee",
        "rating": 1,
        "text_review": "I have been waiting for the activation of my account and trying to get in touch with an agent. It is showing that the agent is supposed call me in 2 mins which turns out to be 15 mins after a minute. but I dont get any communication regarding the same. I have sent numerous emails but nothing has been communicated.",
        "date": "2025-11-02 21:13:01"
    },
    {
        "user_name": "MD AARIF",
        "rating": 1,
        "text_review": "my account is suddenly blocked or frozen my account balance not use or complaint karne ke bad bhi koi response nhi mila very bad service",
        "date": "2025-11-02 11:52:21"
    },
    {
        "user_name": "彡 Eᴀꜱᴡᴇʀ 彡",
        "rating": 1,
        "text_review": "why there only federal bank or hdfc or axis. THT SHOULD BE ANY BANK.not a good app, i want to close my account",
        "date": "2025-10-31 18:35:07"
    },
    {
        "user_name": "Anmol Puranik",
        "rating": 1,
        "text_review": "Forcefully liquidated my ETFs. As per IFSCA circular it only restricts providers from offering these products like Bitcoin ETFs, but does not mention a requirement for existing holders to sell or liquidate their assets if already bought before the circular was shared. INDMoney forcefully sold without my confirmation. This is a breach in customer service.",
        "date": "2025-10-31 17:30:29"
    },
    {
        "user_name": "Sri Harsha",
        "rating": 1,
        "text_review": "The app and interface is pretty good. I used to use et money earlier but now I feel it has become cluttered. The only issue for me is that im not able to edit my SIP since one month. Its always showing coming soon. As a result im compelled to move to et money again. Hope you fix it. Till then 1 star.",
        "date": "2025-10-31 09:26:14"
    },
    {
        "user_name": "Nitin Pande",
        "rating": 1,
        "text_review": "Such an invasive app. Keeps trying to read your emails, credit cards and everything else...for an app marketed for stocks and mutual funds. Interface is designed in such a way that it is very difficult to deny it these permissions. It keeps asking for it, and in different ways making it so difficult. Despite being so careful during set up including unchecking boxes, it still got access to my gmail and got access to my credit card information. I had to go back and manually remove everything.",
        "date": "2025-10-31 07:30:32"
    },
    {
        "user_name": "Sunny Vishwakarma",
        "rating": 1,
        "text_review": "apps is not supporting in my device moto 4 e plus please respond me",
        "date": "2025-10-30 22:22:57"
    },
    {
        "user_name": "Yummy food Shorts",
        "rating": 1,
        "text_review": "please fix upi glitc and every thing is good..but please fix upi payment glitch",
        "date": "2025-10-30 18:06:13"
    },
    {
        "user_name": "Paras Savla",
        "rating": 1,
        "text_review": "WhatsApp cant withdraw balance only forces you to open federal bank account",
        "date": "2025-10-30 11:13:07"
    },
    {
        "user_name": "Vishu Mandy",
        "rating": 1,
        "text_review": "worst trading app , do not do trading in this app, its withdrawal system is way pathetic, its a scam which they do with traders",
        "date": "2025-10-30 11:02:20"
    },
    {
        "user_name": "Master",
        "rating": 1,
        "text_review": "poor size of FONT in market depth and Other details, its like pain to my eyes... Shameful",
        "date": "2025-10-29 20:19:21"
    },
    {
        "user_name": "Alok Choudhary",
        "rating": 1,
        "text_review": "Is it fair to receive deposit at Rs 89.68 per dollor and allow withdrawal at 87? which means you steal 3000 Rs per 1 lac withdrawl.",
        "date": "2025-10-29 11:42:35"
    },
    {
        "user_name": "Mayur Kumar Jain",
        "rating": 1,
        "text_review": "very very bad experience..... dont any transction ..this company is big frauder... and very hopeless customer service...pls boycut.",
        "date": "2025-10-27 11:38:43"
    },
    {
        "user_name": "Himanshu Singhal",
        "rating": 1,
        "text_review": "one star for the most ridiculous and annoyong ad campagin. kya aapko aapki netbworth pata hai, koi gusses bhi nahi, koi round figure bhi nahi exact number batao. abe kyon batao aur kisko batao. is video ka to link bhi nahi hai youtube par. navin prabhakar ka joke yaad aa gaya. pehcan kaun, nai juli bhi nahi, chanda bhi nahi.... i usually dont install this type of faltoo apps but just imagine how Irritating that ad was that i installed this app just to make this review. abe aaj jo net worth",
        "date": "2025-10-26 12:54:03"
    },
    {
        "user_name": "kishore c",
        "rating": 1,
        "text_review": "so many hidden charges. for eg.,DDPI activation, while activation it doesnt show any info. after completion, it shows in the transaction as estamp,e sign so and so..",
        "date": "2025-10-26 09:00:37"
    },
    {
        "user_name": "Santhosh J Prabhu",
        "rating": 1,
        "text_review": "Changing my review after the issue is faced. recently my mutual fund investment was not getting updated and I raised the issue. Found out that customer service is really bad in this organization. They expect me to find the reason for mismatch in investment value and go back to them to get it fixed.",
        "date": "2025-10-26 06:47:19"
    },
    {
        "user_name": "Abdul Gaffar",
        "rating": 1,
        "text_review": "app is charging trades at very high rates please dont use this app better to go with zerodha or grow",
        "date": "2025-10-25 13:07:06"
    },
    {
        "user_name": "Akshay Shrishrimal",
        "rating": 1,
        "text_review": "SCAM APP. LOAN WALO K BAHUT MESSAGE AA RAHE HAI JAB ISKA LOGIN KIYA. APP NE MERA INFO LOAN WALO KO BECHA HAI. TOTALLY WRONG.",
        "date": "2025-10-25 08:57:10"
    },
    {
        "user_name": "Parashuram Hosamani",
        "rating": 1,
        "text_review": "dont instala this app feka app dont by any stak i have 12000 many not refanding. not investment in this aopp",
        "date": "2025-10-24 16:15:46"
    },
    {
        "user_name": "Aaron Lobo",
        "rating": 2,
        "text_review": "I cannot access the app from my tablet. I can only access it from my phone",
        "date": "2025-11-28 01:07:56"
    },
    {
        "user_name": "Sashank Barua",
        "rating": 2,
        "text_review": "why did the monthly SIP dashboard was suddenly take down",
        "date": "2025-11-08 02:26:53"
    },
    {
        "user_name": "Prakash Kumar Singh",
        "rating": 2,
        "text_review": "Pros 1. Best user interface for options trading. 2. Us stocks buying feature. 3. Mind feature king of the features. Cons 1. Trading views chart missing in flash mode. 2. Option chain windows takes lot of space in web mode. Solution could be auto hide or manual hide feature in web mode 3. Advanced option chain option should be provided such as dhan, upstox. For other greeks 4. Paper trading feature or bactesting feature missing. 5. App crash so frequent.",
        "date": "2025-11-03 23:28:15"
    },
    {
        "user_name": "Joshua",
        "rating": 2,
        "text_review": "Us stock adding money conversion charges are very high compared to Real exchange rate. Add option to add via UPI or Forex Cards or Credit cards people have Many cards that are zero forex charges.",
        "date": "2025-11-02 23:46:11"
    },
    {
        "user_name": "Sagar Vaish",
        "rating": 2,
        "text_review": "indicator settings get deleted automatically..all charts indicator gets reset.. and out of nowhere it shows random saved preset which I didnt save or applied.",
        "date": "2025-10-31 12:50:31"
    },
    {
        "user_name": "Tony Stark",
        "rating": 2,
        "text_review": "NEW ISSUE AUG2025 why bank transaction time showing as AEDT, insteed of IST ? For UPI scan also its asking for password after that also i shows some error we have to force close to scan again. Wow more details in Analysis now, please add seperate card for tax saving funds. Please reinstate it or adopt Growws approach. Also, EPFO tracking needs improvementmany users at HCL, TCS, Infosys, etc., use private PF trusts. Else, Add manual entry like Artos. Add support to Wifi android tablets.",
        "date": "2025-10-29 23:43:11"
    },
    {
        "user_name": "Abhishek Goyal",
        "rating": 2,
        "text_review": "no market depth is there is, when we select securities, unable to see buy sell activity , overall immature app makers , difficult fir trading, the app is ok for newbies , for expirience trader like me it wastage of time",
        "date": "2025-10-27 07:53:29"
    },
    {
        "user_name": "Aseem Kumar",
        "rating": 2,
        "text_review": "It asks for phone number, name as per PAN card, etc. May be even imposes its products, monitoring, etc. Refused to complete sign up. Uninstalled.",
        "date": "2025-10-24 18:41:56"
    },
    {
        "user_name": "Rishabh Kumar",
        "rating": 2,
        "text_review": "I admire and enjoy the indian stock trading experience. but the US one is unusable for trading by its design. the maxed out brokerage charges that is not based upon no. of stocks one buys. The max cap of 25 is insane for indian traders. it will drink up all returns. If the app just fixes this plus with some more high interest FD options from SFBs it could be the ideal money management app. these things are limiting the app to become market leader.",
        "date": "2025-10-23 21:05:29"
    },
    {
        "user_name": "Bhushan Chinchmalatpure",
        "rating": 2,
        "text_review": "App doesnt work with BSNL 4G EVEN though speed is 40 mbps. app shows message you are on malicious network. Please do the needful. look is fresh, Clear UI forced me to stay with this app",
        "date": "2025-10-21 23:39:38"
    },
    {
        "user_name": "Puman Wangsu",
        "rating": 2,
        "text_review": "after updated the app stuck not smooth i want old version",
        "date": "2025-10-20 12:39:21"
    },
    {
        "user_name": "아비 아드웨이트",
        "rating": 2,
        "text_review": "Indmony mobile number update too difficult. 6 months waiting time too much longer so, sorry to say that Im close demat trading account Indmony but Im happy with motilal oswal demat account service now i trade in us stocks.",
        "date": "2025-10-15 07:30:32"
    },
    {
        "user_name": "KAPIL BHANDARI",
        "rating": 2,
        "text_review": "very sad no option for students to create federal saving account for us stock investment. there should be option for students",
        "date": "2025-10-14 08:25:01"
    },
    {
        "user_name": "amit kumar",
        "rating": 2,
        "text_review": "KINDLY read carefully Feedback .......... Sir, please bring your short UPI ID, implement next generation technology and AI tools. Employ worldclass professionals.Provide investment services through debit cards, RBI listed wallets, prepaid cards, credit cards etc.",
        "date": "2025-10-13 00:19:49"
    },
    {
        "user_name": "Abhishek Singh",
        "rating": 2,
        "text_review": "i forget my previous mobile no. i cant login on app can you help me to login with email id because email id was same that time",
        "date": "2025-09-28 19:49:34"
    },
    {
        "user_name": "Arif Warsi Laskar",
        "rating": 2,
        "text_review": "Why can I not add the fund in a basket from my portfolio ? Every time I need to buy multiple MF units, I have to go one by one. This is a very common feature of every trading app, and also convenient. I wrote the complaint about it and a customer care executive gave the solution that I can use the MF basket from the app, but there everything is predefined. Even though I can change the MF, but I cant change the percentage or add a new fund. You can consider adding this feature.",
        "date": "2025-09-28 11:23:37"
    },
    {
        "user_name": "Supriya Metiya",
        "rating": 2,
        "text_review": "good platform but i find one bad ux problem in slide option to increase or decrease money, it would be better if we just write the amount",
        "date": "2025-09-25 16:41:52"
    },
    {
        "user_name": "HM MANAS",
        "rating": 2,
        "text_review": "App is good and smooth..but it has very high trading, delivery, mtf and other hidden charges",
        "date": "2025-09-25 10:32:46"
    },
    {
        "user_name": "prajeesh karayil",
        "rating": 2,
        "text_review": "Interface wise this app is good, but the number of times the app was unable to open. showing an error message like your device is rooted. This app will not work. without proper testing they are pushing the app to the play store. In another scenario place buy order button is enabled even without sufficient fund. Today 19092025 app not loading the flash mode its showing a blank page, also If we configured any SL or Target we have to cancel that before selling.So I am not recommended forFO",
        "date": "2025-09-19 09:57:02"
    },
    {
        "user_name": "Sam",
        "rating": 2,
        "text_review": "Im not able to edit my mutual fund it just shows edit option as coming soon its so frustrating. how can i manage my SIP once i set it?",
        "date": "2025-09-19 09:49:25"
    },
    {
        "user_name": "Himanshu Jain",
        "rating": 2,
        "text_review": "Ind money is far inferior tech wise than its competitors. After using this for a while i know that they need to invest a lot in their tech if they really want to capture the market.. their thoughts can be seen but execution is lacks precision. Us stocks dont have candle charts, sorting feature for portfolio not available, fees is hidden somewhere so that u cant find it easily. 1 week chart has 8 days.. so they are bloating app with features but no one is testing it..",
        "date": "2025-09-11 02:08:49"
    },
    {
        "user_name": "Rajesh Sahoo",
        "rating": 2,
        "text_review": "why there is no dedicated customer care number. I am facing problem to resolve my issue and i cant contact directly and investing my hard earned money with you. what is the trust. ok you have a help center where we can raise tickets then somebody will contact us but there is no way to reach your team directly from my side. what if no body replies on that ticket? App is good but not getting that trust",
        "date": "2025-09-08 17:09:14"
    },
    {
        "user_name": "Bhudipta Bhatta",
        "rating": 2,
        "text_review": "Required more Options for FD AAA Rated of all Stable Bonds by this application of Platform. Then it will be more believed more popular all over Indian Customers.",
        "date": "2025-09-03 17:31:11"
    },
    {
        "user_name": "Arun AJ",
        "rating": 2,
        "text_review": "Show actual invested and current amount as a whole instead of rounded figures.",
        "date": "2025-08-31 22:40:41"
    },
    {
        "user_name": "Sankar Roy",
        "rating": 2,
        "text_review": "What the hell! Has happened to this app with the update. Now the app is not showing proper Net Profit and Loss properly, what was easy to check, previously.",
        "date": "2025-08-30 12:11:08"
    },
    {
        "user_name": "Naresh Ugaonkar",
        "rating": 2,
        "text_review": "Very little information is show about a US stock or a ETF for example cant see the complete holdings of an ETF neither can you see the expense ratio of a ETF. lot of basic information is missing which makes have to go outside the app and do research and then invest.",
        "date": "2025-08-16 21:13:06"
    },
    {
        "user_name": "Srikanth Jinaga",
        "rating": 2,
        "text_review": "We cannot use this app when mobile is connected to wifi.",
        "date": "2025-08-08 12:29:01"
    },
    {
        "user_name": "Teja Teja",
        "rating": 2,
        "text_review": "Ive been using the app without issues while monitoring and later investing in stocks. Recently, the app flagged my device as rooted or compromised, despite it running stock firmware with no modifications. Please clarify the basis for this and how to resolve it. Also, the app should provide a builtin report option relying on the Play Store for support isnt practical. A proper ticketing system is needed.",
        "date": "2025-07-28 10:02:36"
    },
    {
        "user_name": "Chinmay PARDESHI (VinayaK Pardeshi)",
        "rating": 2,
        "text_review": "i have been using this app on my device for years and suddenly after updating it says that device is rooted or compromised. Before update it was working now it is not opening fix this please. I havent rooted my mobile and there is no virus on my mobile.",
        "date": "2025-07-28 09:40:56"
    },
    {
        "user_name": "AJ",
        "rating": 2,
        "text_review": "Hey, today this app shows this devicemy device is rooted or compromised. App will not work on compromised device due to security reasons. I dont know what you are building but you should test it before deployment to live audience. my phone is never rooted, I tried with another phone as well it show same message. lets assume my phone is compromised but 3 people in my house use indMoney and everyone sees this device is rooted. No, something is not working at your end, please check.",
        "date": "2025-07-28 09:36:04"
    },
    {
        "user_name": "Vickneswaran Ezhilraj",
        "rating": 2,
        "text_review": "All of a sudden app wont start saying mobile is rootted or comprised..not able to do anything",
        "date": "2025-07-28 09:27:17"
    },
    {
        "user_name": "Abhishek Mishra",
        "rating": 2,
        "text_review": "getting tired of the device rooted warning. Im using a stock motorola edge 40 which is also a company managed device.",
        "date": "2025-07-28 09:25:27"
    },
    {
        "user_name": "Arihant Infocomm",
        "rating": 2,
        "text_review": "On boarding is not smooth, for past 2 days I am trying to onboard but no success in transferring money, no help from any where",
        "date": "2025-07-24 20:39:50"
    },
    {
        "user_name": "Aabid Hassan",
        "rating": 2,
        "text_review": "Poor support of customer representatives Mapped Rms . No call from any team member despite manh reminders via call or mail Totally pathetic performance",
        "date": "2025-07-18 06:38:35"
    },
    {
        "user_name": "Prakash Singh",
        "rating": 2,
        "text_review": "any update about the ios app, as its not working.",
        "date": "2025-07-16 16:07:07"
    },
    {
        "user_name": "Vikas Sah",
        "rating": 2,
        "text_review": "App interface is good but some major problems are there. 1. Price difference on trading. 2. In the previous version, trading view chart was an option which has been removed now. Provided IND chart tools are not matching even basic level. Analysis of chart has become too too hard now. has to switch app for ease in trading. Customer base surely gonna shift now.",
        "date": "2025-07-15 14:18:41"
    },
    {
        "user_name": "nikhil chaudhary",
        "rating": 2,
        "text_review": "not able to use indpay upi instead amount held in wallet",
        "date": "2025-07-14 23:06:28"
    },
    {
        "user_name": "Indra Kumar",
        "rating": 3,
        "text_review": "Mutual fund showing the absolute rate which is not correct for SIP investment, it should show the XIRR returns, which is the correct way to check our investment returns, When we see our portfolio it can see only absolute returns not able to find we are investing correct way",
        "date": "2025-11-28 02:06:59"
    },
    {
        "user_name": "Vishal Official",
        "rating": 3,
        "text_review": "A very important update is needed in the app For any order weve placed, the current price of that stock or option should be visible in the Orders tab. This helps us track the price fluctuations and decide whether to cancel the order or let it execute.Also, if we cancel an order, there should be a Reorder option so we can place the same order again easily.",
        "date": "2025-11-26 14:46:02"
    },
    {
        "user_name": "Niraj Bhatt",
        "rating": 3,
        "text_review": "please use full names instead of first name and last name for nominees as most government IDs use full names. please sort assets in descending order of value in the main myIND page. INDpay UPI ID exposes our phone numbers, and there is no option to change it!",
        "date": "2025-11-26 12:48:19"
    },
    {
        "user_name": "ಸಮರ್",
        "rating": 3,
        "text_review": "Add in mutual funds fortnightly payment options feature in mutual fund section in next update for better convenience.",
        "date": "2025-11-26 11:25:51"
    },
    {
        "user_name": "Chetan Morey",
        "rating": 3,
        "text_review": "I am reducing my rating from 4 to 3 stars. In the recent software update they have removed the sort filter option from the watchlist. How do I monitor all my ETFs? Ind money why remove essential basic features? Please restore the original watchlist, which had sort by return, filter, current price 1 days return. Apart from that the overall app experience is good. I recommend this app for managing wealth.",
        "date": "2025-11-23 13:37:27"
    },
    {
        "user_name": "fathimathul zohara",
        "rating": 3,
        "text_review": "I need to change my number and add another account but there is no option there, I cant even delete my account to log in again with another number. What am I supposed to do now?",
        "date": "2025-11-21 11:23:04"
    },
    {
        "user_name": "Arvind Kumar",
        "rating": 3,
        "text_review": "us trading Federal bank KYC is Very Difficult many I many time trying please improve this.",
        "date": "2025-11-20 12:17:13"
    },
    {
        "user_name": "Veeresh Shivarudraiah",
        "rating": 3,
        "text_review": "need more instruments on chart reading in F and O",
        "date": "2025-11-14 07:46:09"
    },
    {
        "user_name": "R Mawlong",
        "rating": 3,
        "text_review": "there is an issue in doing vkyc from the app, in relation to echoing audio, all the time i have initiate the vkyc and not successful, i have not experience any issue with vkyc that are done through chrome browser, i dont if the problem is with the phone or from the app",
        "date": "2025-11-09 08:58:34"
    },
    {
        "user_name": "Deep Shah",
        "rating": 3,
        "text_review": "Huge charges, exchange rates are higher plus bank charges you additional on exchange rates Average 25 are gone in charges only Hurdle to initiate investments",
        "date": "2025-11-08 19:53:51"
    },
    {
        "user_name": "SRT",
        "rating": 3,
        "text_review": "Need to track Lic policy ..when this feature will be added?",
        "date": "2025-11-04 00:17:50"
    },
    {
        "user_name": "Swarnadeep Basak",
        "rating": 3,
        "text_review": "Please add APY, LIC tracking as soon as possible and in PPF tracking section, recurring deposit start date is fixed for today but it should be flexible for future dates too like end date. Fix these issues immediately, it will help tracking easier and effective.",
        "date": "2025-11-03 23:54:35"
    },
    {
        "user_name": "Darshanesh Patil",
        "rating": 3,
        "text_review": "There is a need of improvement in various sections of the app which will make the app even better 1 Quick easy tax filing with consultation 2 US and Indian stock custom bucket portfolio creation optionsimilar to smallcase 3 Just like Mutual funds What if I redeem today it should also be available for Indian Stocks 4 Digital gold investment",
        "date": "2025-11-02 21:48:54"
    },
    {
        "user_name": "raghav seth",
        "rating": 3,
        "text_review": "earlier used to show xirr on US stocks portfolio, now why you have stopped?",
        "date": "2025-10-31 20:16:15"
    },
    {
        "user_name": "L Aman",
        "rating": 3,
        "text_review": "Man I have a complaint I try to order something from Flipkart and I did sent my upi id to flipkart to make payment but in my indmoney app there are no notification about sending money I cant order any thing from it help , its not like my money is debit",
        "date": "2025-10-31 10:51:27"
    },
    {
        "user_name": "Aakash S",
        "rating": 3,
        "text_review": "Ill admit, INDmoney has a really attractive and userfriendly interface its easy to navigate and visually appealing. But what really disappointed me is their claim of no hidden charges. After comparing with Groww, I realized INDmoney adds several hidden fees that arent clearly disclosed upfront. The DP charges and other costs eat into profits, especially for small trades. Its frustrating and feels misleading. Great design, but poor transparency. Not a good experience overall.",
        "date": "2025-10-27 12:25:54"
    },
    {
        "user_name": "Sauronil “Alhaitham” Joy",
        "rating": 3,
        "text_review": "The headlines r mostly FOMO inducing or completely Fear Mongering like the rule 10b 5 CEO Sell is always highlighted as Future Uncertainty for a company and Sign as a collapse, whereas reality is completely nuanced and is nothing to be worried about, that is a normal part of the process. Without the alert and headline part, this is actually a grt app. I need real and nuanced headline, if not, please give me an option to disable them, Thank you.",
        "date": "2025-10-23 11:41:18"
    },
    {
        "user_name": "Subham Seal",
        "rating": 3,
        "text_review": "I dont know why they stopped showing CAGR for US stocks. Also same problem for Indian stocks. Please ask your developers to redeploy these features.",
        "date": "2025-10-15 03:38:22"
    },
    {
        "user_name": "Krishna Pani",
        "rating": 3,
        "text_review": "can u please tell me how can I track my lic investment on ind money",
        "date": "2025-10-13 22:11:42"
    },
    {
        "user_name": "Md Amin",
        "rating": 3,
        "text_review": "it makes learning interesting and has the capability to replace reels",
        "date": "2025-10-12 11:49:52"
    },
    {
        "user_name": "Kislay Kumar",
        "rating": 3,
        "text_review": "DTH recharge stuck while billing and amount deducted... Sometimes the NPS investment shows unrealistic figure Edit1 DTH recharge failed still persist Edit2 NPS amount not updating since last 3 months",
        "date": "2025-10-07 10:28:16"
    },
    {
        "user_name": "Nadeem SLF",
        "rating": 3,
        "text_review": "brokerage of 10 rs per trade is enough. dont u have option of zero brokerage. with annual plan",
        "date": "2025-10-07 06:17:48"
    },
    {
        "user_name": "RamprasadAviator",
        "rating": 3,
        "text_review": "Lot of Pop up and Distractions in the UI ., you should improve Dashboard layout and overall app design without marketing popup or distractions. it should me informative and easy to use.",
        "date": "2025-10-07 00:11:52"
    },
    {
        "user_name": "SRI KRISHNA KONIDALA JAYARAM",
        "rating": 3,
        "text_review": "not a investor friendly ideas found in this app and operations.",
        "date": "2025-10-06 14:25:42"
    },
    {
        "user_name": "praveenkumar talawar",
        "rating": 3,
        "text_review": "need suggestions on stocks and tools analyze stocks so that we invest",
        "date": "2025-10-04 20:42:02"
    },
    {
        "user_name": "Vijay Ponangi",
        "rating": 3,
        "text_review": "good finance tracking app.Need to add insurance, physical gold silver assets tracking physical real estate tracking.",
        "date": "2025-10-03 21:38:32"
    },
    {
        "user_name": "Sachin",
        "rating": 3,
        "text_review": "When will be allowed to sell new IPOs and listings at 935 AM or 945 AM? It always says to wait till 10 AM",
        "date": "2025-09-29 22:26:33"
    },
    {
        "user_name": "Mukul Gupta",
        "rating": 3,
        "text_review": "Please optimise app for Samsung Fold 7. Currently the app is horrible to use on the full screen of Fold7 but it could be so much better. I hope the devs will fix this ASAP.",
        "date": "2025-09-26 17:17:03"
    },
    {
        "user_name": "Debasish",
        "rating": 3,
        "text_review": "super app advance chart prediction for options Trading is very very helpful relly love it.. But system works slow delay to opening charts order execute and Complex app",
        "date": "2025-09-24 14:53:09"
    },
    {
        "user_name": "HARMEET SINGH",
        "rating": 3,
        "text_review": "They only support UPI as a payment method to buy new funds. Before, there were multiple options to choose",
        "date": "2025-09-21 00:01:52"
    },
    {
        "user_name": "Ayush Salampuriya",
        "rating": 3,
        "text_review": "good app but still international stockindex prices are delayed by 15 minutes which is not at all understandable!! like gift nifty, nasdaq and other major indices pricing are delayed. if you are providing us stock buysell, then this is expected from indmoney!!",
        "date": "2025-09-17 23:40:14"
    },
    {
        "user_name": "Aritra Ghosh",
        "rating": 3,
        "text_review": "Great app. Also high time for a Dark mode now. Try to keep the calculations more accurate, for a finance app.",
        "date": "2025-09-17 07:09:46"
    },
    {
        "user_name": "Deependra Pratap Singh",
        "rating": 3,
        "text_review": "allow any bank in name and linked to mobile number for sip upi auto pay like Paytm money. one mandate setup and link various sip .",
        "date": "2025-09-14 14:33:39"
    },
    {
        "user_name": "Sweta Gupta",
        "rating": 3,
        "text_review": "NPS can only be added if you have Google account added to it. Why this is so? does not make sense.",
        "date": "2025-09-14 10:09:41"
    },
    {
        "user_name": "PRIYANSHU MISHRA",
        "rating": 3,
        "text_review": "make your separate upi app ..its messy in one app",
        "date": "2025-09-10 21:09:51"
    },
    {
        "user_name": "sumit pant",
        "rating": 3,
        "text_review": "its early days since I have started using the app, however one feature I found issue with is that after closing the app, if one opens again then sometimes it opens without asking for password, which is not ok, almost all fintech apps that I uses ask for password the moment the screen is left idle for over a min or so. thus would request to check this out",
        "date": "2025-09-09 06:39:09"
    },
    {
        "user_name": "Sparsh Ahuja",
        "rating": 3,
        "text_review": "The date of the transaction in the mutual fund is difficult to understand.",
        "date": "2025-09-08 11:13:30"
    },
    {
        "user_name": "Sterrysh",
        "rating": 3,
        "text_review": "Let us see both realized and unrealised gains. I dont understand why you did that.",
        "date": "2025-09-02 13:22:04"
    },
    {
        "user_name": "Karthik Rao",
        "rating": 3,
        "text_review": "I have been using this app for more than a year. Its mostly good until you hit a snag with the app. Once you do you are screwed. Their customer support is fast but absolutely useless. Theyll never accept any issue at their end. Especially in the bill payment side. Happened on multiple occasions. Thoroughly disappointed. I need to find a better app to switch out to.",
        "date": "2025-08-21 12:59:29"
    },
    {
        "user_name": "Manas Goswami",
        "rating": 3,
        "text_review": "Good app but not great. It can not generate integrated view of family dashboard. I only want to see integrated view of all assets but its mandatory to open invest dmat account etc without any purpose. Please improve. Also only absolute returns are shown not XIRR also no option to change XIRR as default. In other apps like kuvera its not Mandatory to open dmat and I can see integrated view of family investment.",
        "date": "2025-08-18 01:21:37"
    },
    {
        "user_name": "Emmanuel Ethiraj",
        "rating": 3,
        "text_review": "I cant sign up , its showing my gmail id is linked with other number,",
        "date": "2025-08-16 17:16:43"
    },
    {
        "user_name": "Sandeep Singh Parihar",
        "rating": 3,
        "text_review": "good app but I cant track my SSA, LIC Policy please add option.....",
        "date": "2025-08-16 07:17:38"
    },
    {
        "user_name": "Benjamin",
        "rating": 3,
        "text_review": "Like Indmoney as it allows to track all your financial assets. It would be better if we can import all stocks in other demat accounts like we import external mutual fund.",
        "date": "2025-08-12 14:57:30"
    },
    {
        "user_name": "Pavaman Bhat",
        "rating": 3,
        "text_review": "There should be a way to track my gold assets.",
        "date": "2025-08-09 22:27:07"
    },
    {
        "user_name": "Jayantilal Panchal",
        "rating": 3,
        "text_review": "Giving 3 stars, because sometimes the app doesnt support UPI payments and says to update to the latest version or to reopen the app, even though the app is at the latest version. Even after reopening the app the same message is displayed and I cant make any UPI payments. Please resolve this issue by providing a new version for this app.",
        "date": "2025-08-06 11:16:31"
    },
    {
        "user_name": "Nibha Kumari",
        "rating": 3,
        "text_review": "the app is quite good but from today my app is not working and showing that your device is rooted . please help me with that",
        "date": "2025-07-28 09:41:20"
    },
    {
        "user_name": "Vishnuraj NR",
        "rating": 3,
        "text_review": "the app stopped working suddenly showing device is rooted. while all my banking and other financial apps are working fine. seems its a problem with indmoney alone",
        "date": "2025-07-28 09:38:41"
    },
    {
        "user_name": "Kiran NS",
        "rating": 3,
        "text_review": "Thanks XIRR issue resolved. The other issue I have is my UPI ID is not the default one anymore. I have to take few more steps to chose my UPI ID for the payment.",
        "date": "2025-07-23 16:06:56"
    },
    {
        "user_name": "A Kay",
        "rating": 3,
        "text_review": "Does not provide option to track other bank accounts linked to other mobile numbers. Maybe fetch all bank account of a person from the PAN to calculate accurate networth.",
        "date": "2025-07-21 11:07:30"
    },
    {
        "user_name": "Hemant Grover",
        "rating": 3,
        "text_review": "Lately tracking external FD function is not working.. please fix that and Im happy to revise my ratings as this is a good app..",
        "date": "2025-07-20 14:37:09"
    },
    {
        "user_name": "Sahil Maru",
        "rating": 3,
        "text_review": "I need help to include my HUF karta PAN. so that I can track all my investments which are done through HUF. I dont see that provision very clear in the app. can help and suggest how I can include that.",
        "date": "2025-07-18 14:12:23"
    },
    {
        "user_name": "Pradip Roychowdhury",
        "rating": 3,
        "text_review": "now security increased, one thing if i want to stop sip no option is available.",
        "date": "2025-07-18 10:22:39"
    },
    {
        "user_name": "Rohit Kumawat",
        "rating": 3,
        "text_review": "Please clean up your UI. There are too many elements",
        "date": "2025-07-17 16:23:27"
    },
    {
        "user_name": "priyank shaw",
        "rating": 4,
        "text_review": "Everything in the app is nice . I just want a direct chat with agent customer support in app .",
        "date": "2025-11-27 14:52:11"
    },
    {
        "user_name": "Nasir Khan",
        "rating": 4,
        "text_review": "Hi. Your application is one of the best tradinginvestment apps in the market. However, I found a small issue in your app. The daily time frame charts in the US market dont seem to show accurate data. Kindly look into this matter asap to provide the best possible trading experience for your users. Thanks!",
        "date": "2025-11-25 20:29:07"
    },
    {
        "user_name": "Ashish Yadav",
        "rating": 4,
        "text_review": "Their Charts and Prediction are very informative and Easy to understand",
        "date": "2025-11-24 10:51:18"
    },
    {
        "user_name": "Shatadal Sarma",
        "rating": 4,
        "text_review": "please add loans also to track everything in one app in auto track feature add other mail also",
        "date": "2025-11-22 11:24:08"
    },
    {
        "user_name": "Abhishek Sarkar",
        "rating": 4,
        "text_review": "It is a good app, but at times not sure at all about the changes in values. Tough to figure out the difference.",
        "date": "2025-11-21 14:39:47"
    },
    {
        "user_name": "YCC entertainment",
        "rating": 4,
        "text_review": "please bring back feature in option chain about o.i info that show info about long short covering and. long short building on different strike in Indian share,its helping to entry exit on position",
        "date": "2025-11-20 15:32:38"
    },
    {
        "user_name": "Vishal Official",
        "rating": 4,
        "text_review": "I want to request the INDMoney teamdevelopers to show the latest price of stock or options in the Order tab as well. This will help us see price fluctuations and decide whether we should cancel the order or let it get executed. Also, there should be a Reorder option in cancelled orders so we can place the same order again from there.",
        "date": "2025-11-19 12:56:40"
    },
    {
        "user_name": "Ranjidharan G",
        "rating": 4,
        "text_review": "When I was trying to convert my RI dematMF account to NRO account, the CS representative requested me to translate the foreign address proof document to English. However, the same document was translated by ICICIBANK and HDFC banks by themselves during account conversion. I think if INDMoney really cares about customer to use their services seamlessly, they should have translation team to translate foreign address proofs for NRIs.",
        "date": "2025-11-15 21:15:38"
    },
    {
        "user_name": "ADI 2030",
        "rating": 4,
        "text_review": "Us stocks investing through Indmoney is strictly not recommended, the backend is unstable and your account will be frozen regularly. The networth tracking feature pulled up my app rating from 1star to 4 stars. welldone",
        "date": "2025-11-14 18:04:14"
    },
    {
        "user_name": "Vijay Kumar Dixit",
        "rating": 4,
        "text_review": "Best app but news hindi and english dono ka hona chahiye aur hindi english dono me hona chahiye aap ko update kare in future ke saath",
        "date": "2025-11-12 12:28:45"
    },
    {
        "user_name": "Himanshu",
        "rating": 4,
        "text_review": "Please Fix these issues otherwise great app. 1. when I open a stocks chart it initially show the previous stocks chart I had opened instead of the current stock. Perhaps a delay in the api call is happening tell the tech team to solve it. 2. When a see an option of buying or selling below a stock chart , when I change the option from delivery to intraday it should also show stoploss option there itself,I need to go back to the positions options and add SL which is quite inconvenient.",
        "date": "2025-11-12 10:32:14"
    },
    {
        "user_name": "Arpan Chettri",
        "rating": 4,
        "text_review": "tracking is awesome but couldnt tracking NPS as it is only linked with Gmail. give option to link with other account as well",
        "date": "2025-11-11 18:46:27"
    },
    {
        "user_name": "Mraphic Studio",
        "rating": 4,
        "text_review": "I was trying to add money in my IND MONEY APP, this app showing 1 per 76.74 rupees, same time I was checked on Google, it showing 1 per 75.92 rupees.",
        "date": "2025-11-10 21:20:21"
    },
    {
        "user_name": "SUSHOBHON SAHA",
        "rating": 4,
        "text_review": "Plez add trading view chart on us stock .stock screener for Indian and us stock. and dark more features.. on app and site.. other thing nice...",
        "date": "2025-11-08 22:45:24"
    },
    {
        "user_name": "Shriverdhan Pathak",
        "rating": 4,
        "text_review": "The new update has messed up the things , the old UI was better , now it has become hard to navigate the indmoney app",
        "date": "2025-11-06 19:42:03"
    },
    {
        "user_name": "Abhilash G K",
        "rating": 4,
        "text_review": "Please add Trailing stoploss option for US stocks, I will rate 5 Star",
        "date": "2025-11-06 02:04:51"
    },
    {
        "user_name": "Kumud Mazumdar",
        "rating": 4,
        "text_review": "I have just got a little dummy training for intraday. hope its a good application.",
        "date": "2025-11-03 16:58:56"
    },
    {
        "user_name": "Mandeep singh rana",
        "rating": 4,
        "text_review": "few steps are deep inside, and are sometimes difficult to find.",
        "date": "2025-11-02 23:10:40"
    },
    {
        "user_name": "Jagannath Sahoo",
        "rating": 4,
        "text_review": "i can not track my DCB Bank account bank balance. Kindly add DCB Bank in the list.",
        "date": "2025-11-01 11:01:35"
    },
    {
        "user_name": "farheen sheikh",
        "rating": 4,
        "text_review": "Using it since 45 years. Mostly I use it for US investments and it is easy and convenient. US deposits are also very fast. Few things would like to have in the app is to show the graphical yearlymonthly etc. growth of my US portfolio. Also I remember I used to see XIRR of my US portfolio but now cant see it anymore.",
        "date": "2025-10-29 22:32:30"
    },
    {
        "user_name": "Payal Kumari",
        "rating": 4,
        "text_review": "it gives opportunity to learn more and invest more it updates us to analyse the market more effectively so I find this app very useful for different investments purpose thankyou indmoney",
        "date": "2025-10-29 17:17:16"
    },
    {
        "user_name": "Rohit Gupta",
        "rating": 4,
        "text_review": "no option to track, NPS with mail id other then gmail. NPS linked mail id is with Outlook so cant track NPS.",
        "date": "2025-10-29 10:27:44"
    },
    {
        "user_name": "Avinash Pagunta",
        "rating": 4,
        "text_review": "I think this app has come very far since it started. It has a lot of things to add but I feel its a complete app",
        "date": "2025-10-29 00:07:33"
    },
    {
        "user_name": "Mukesh Patil",
        "rating": 4,
        "text_review": "I simply like this app. It is well configured to track your investments. Also allows to track your assets and liabilities, goals, helps to invest in mutual funds, shares, FDs, Insurance through multiple ways. It is improving day by day to add more features to have one window solutions to track your portfolio in real sense. I would suggest improvement in recurring or fixed entries for other, private or cash investments.",
        "date": "2025-10-28 12:06:52"
    },
    {
        "user_name": "Maaz Fazil",
        "rating": 4,
        "text_review": "update you finally gave the dark theme, thanks a lot. it is helpful The app is great and the interface is also good. However, needs to improve on one thing IPO details, especially financials are not provided properly",
        "date": "2025-10-28 11:51:04"
    },
    {
        "user_name": "Suresh Pattika",
        "rating": 4,
        "text_review": "very nice i like it very much and it has super user friendly inter space",
        "date": "2025-10-26 17:58:57"
    },
    {
        "user_name": "Alok KUMAR",
        "rating": 4,
        "text_review": "earlier I rated this as 1 star as I was not able to add real state as my networth but they called me and describe how I can do it. it has the option to add real state. but real state is one of the major part of our net worth so it should be highlighted in an easy way.",
        "date": "2025-10-24 13:49:43"
    },
    {
        "user_name": "ANANT MOMAYA",
        "rating": 4,
        "text_review": "I am really happy using the IND Money app for tracking all my investment it would be great if you can also track your Home loan in this app so it becomes all in 1 app for all our financial needs",
        "date": "2025-10-20 15:14:06"
    },
    {
        "user_name": "YOGESH WANDRE",
        "rating": 4,
        "text_review": "The app is easy to use. They should also move on to crypto currency with sip. Thankyou so much.",
        "date": "2025-10-20 00:01:15"
    },
    {
        "user_name": "RUBY Singh",
        "rating": 4,
        "text_review": "How to add APY? its giving option of NPS but not APY. please advise.",
        "date": "2025-10-19 09:31:10"
    },
    {
        "user_name": "Senthil Kumar Natarajan",
        "rating": 4,
        "text_review": "Outright App is good. But 2 improvements I expect. 1. Graphs are not having partitions. Meaning if I see a week duration it is not having grid for 7 days. Same applicable for all 1D, 1M, 6M, 1Y 2. This app does not have widget. But Groww app has a good one. I no need to open app to see my 1D and overall returns with refresh, hide amount option. First Class!!!",
        "date": "2025-10-18 13:12:10"
    },
    {
        "user_name": "manish dubey",
        "rating": 4,
        "text_review": "Overall a good app, can track all money and family investment at one place. But it will be good if you provide refreshing or tracking my bank account and epf more than once in a day.",
        "date": "2025-10-15 09:53:53"
    },
    {
        "user_name": "Venkatesh Kumar",
        "rating": 4,
        "text_review": "App is good on interface and usability and networth calculation is a good feature to set goals based on assets currently have but market price of silver is not updating correctly.",
        "date": "2025-10-11 22:10:39"
    },
    {
        "user_name": "ABHIK NEOGI",
        "rating": 4,
        "text_review": "The app is very good for track all your investments in one place. But Im not able to link my NPS account with this app, as I get my investment details in yahoomail and not in gmail. Can you tell me the solution to link my NPS account in the app.",
        "date": "2025-10-10 09:12:06"
    },
    {
        "user_name": "Bhavin Chaudhari",
        "rating": 4,
        "text_review": "please add explore tab in minisave long waiting not add explore tab from last six month",
        "date": "2025-10-08 21:03:22"
    },
    {
        "user_name": "Prashant Balamgari",
        "rating": 4,
        "text_review": "So far the app is helping with all kinds of investment related options and is able to track all in one app. clean UI and thanks to no spam with marketing for credit card or any other things. One small thing IND should do which will make a go to finance app is adding an expense tracking option for users. I hope this feedback will be taken into consideration.",
        "date": "2025-10-08 20:46:10"
    },
    {
        "user_name": "Arunmozhi Varman",
        "rating": 4,
        "text_review": "Using 1 year, I really like this app, especially the Assets tab, which makes it easy to track all income sources in one place. AMC and other charges Very reasonable compared to other broking apps. Customer support 3.55. Need to develop a new version of stock view,which shows everything in one place.. sometimes face issues in it and Need to accuracy in order purchase value... Overall, a very useful app for managing and monitoring investments.",
        "date": "2025-10-05 21:26:36"
    },
    {
        "user_name": "Akshay khedekar",
        "rating": 4,
        "text_review": "Please incorporate NPS Tier2 investment under NPS head except this all is top notch.",
        "date": "2025-10-04 18:39:24"
    },
    {
        "user_name": "Pradeep Kale",
        "rating": 4,
        "text_review": "There should be a seperate tab for UPI, because your account is visible when you are doing UPI in public which could be unsafe. The UPI interface is very slow and missing newer features. There are very less downloadable reports for analysis.",
        "date": "2025-10-02 20:13:11"
    },
    {
        "user_name": "Paul Varghese Nepal",
        "rating": 4,
        "text_review": "MODIFY ORDER MISSING After a buy or sell order, if it has not triggered, we should be able modify the existing order instead of having to cancel the order and place a new order. And amount should be invested instantly to drive wealth so we can make immediate alternate decisions with the money credited, instead of taking hours or 2 days to execute the whole process. Make execution in a blink of an eye. Even transferring from an Indian bank taking too long a delay to show up on drivewealth.",
        "date": "2025-10-02 18:12:20"
    },
    {
        "user_name": "Mohamed Faris",
        "rating": 4,
        "text_review": "many foreign company stocks available to trade. like skechers,nestle etc etc and much more. if these stocks are available then its soo good.",
        "date": "2025-10-02 08:59:33"
    },
    {
        "user_name": "White Wolf",
        "rating": 4,
        "text_review": "app is fine but us stock me 4 hi bank he aor add karni chahiye",
        "date": "2025-09-28 20:09:07"
    },
    {
        "user_name": "MALEMNGANBA Demo",
        "rating": 4,
        "text_review": "Im not able to sign in to my account anymore after changing my cell phone. I have everything, but nothing seems to be working.",
        "date": "2025-09-27 01:48:22"
    },
    {
        "user_name": "Harshal Deshpande",
        "rating": 4,
        "text_review": "The portfolio tracking is great but it categorises gold and debt ETFs under Equity which is misleading.",
        "date": "2025-09-21 20:56:03"
    },
    {
        "user_name": "Utkarsh Barsaiyan",
        "rating": 4,
        "text_review": "great app but would be better if you segregate notifications into different categories so that I can turn on only specific categories such as alerts",
        "date": "2025-09-19 11:32:41"
    },
    {
        "user_name": "Ꭺʙʜɪsᴇᴋ Ꭺ",
        "rating": 4,
        "text_review": "I have been using this app for a while time the app is so good comparing with other... And FO is also entry and exit with real time price.. What A app and what a apps team technical and customer Really want to say just within a week my problem was resolved against the UPI thankyou team for taking my difficult as serious and give me the best response as soon as you can with resolving it... Wonderful App with the Wonderful team support",
        "date": "2025-09-19 08:03:39"
    },
    {
        "user_name": "Bimlesh Kumar",
        "rating": 4,
        "text_review": "if I uninstall from my phone, my all data will deleted from your server and from account. there will no risk and will not receive any messages and call ? can you please confirm and explain? team please share asap ?",
        "date": "2025-09-18 21:33:31"
    },
    {
        "user_name": "Sri Vignesh Chandrasekar",
        "rating": 4,
        "text_review": "i using IND money for past 1 year I really love it however 1 small suggestion please add current trading exchange also",
        "date": "2025-09-18 15:16:59"
    },
    {
        "user_name": "Allu Bharathi",
        "rating": 4,
        "text_review": "In this app ipos not accept, when i was applied it says try after some time what was cause i dont no",
        "date": "2025-09-17 15:55:09"
    },
    {
        "user_name": "Ritesh Kumar",
        "rating": 4,
        "text_review": "everything is best.. but onething is missing .. after buying stock in mtf.. we cant add sl in that mtf stock.. so please add that as well and add percentage Trailing function..",
        "date": "2025-09-16 11:45:26"
    },
    {
        "user_name": "yash patel",
        "rating": 4,
        "text_review": "I am using a OnePlus Open fold phone and the user experience is not good when I use the app in full screen.",
        "date": "2025-09-13 23:40:24"
    },
    {
        "user_name": "Murari Kumar Jha",
        "rating": 4,
        "text_review": "This App doesnt support on Tablets. please upgrade the Application so that we can easily used this App on my Tablet instead of Mobile.",
        "date": "2025-09-12 12:03:14"
    },
    {
        "user_name": "Atul Dhamdhere",
        "rating": 4,
        "text_review": "The app is useful to track all investments from multiple platforms but I noticed the app is not showing accurate balance. It would be great if this issue is fix.",
        "date": "2025-09-11 14:01:32"
    },
    {
        "user_name": "Secret Super Star 3152000",
        "rating": 4,
        "text_review": "Worst app cheated eat your money and deducted every time.... experience of 2 years on this app",
        "date": "2025-09-10 22:48:10"
    },
    {
        "user_name": "Vijay Purswani",
        "rating": 4,
        "text_review": "kl mene stock market se 4,588 rs earn kiye the, pr wo amount abhi abhi INDmoney wallet me show nhi kr rha hai, to me kis email pe apni complaint daal skta hu, please bataye",
        "date": "2025-09-09 17:27:04"
    },
    {
        "user_name": "Pankaj Kumar",
        "rating": 4,
        "text_review": "Good Research features and UI is better than other apps",
        "date": "2025-09-08 00:25:40"
    },
    {
        "user_name": "mahesh Chandra Chousali",
        "rating": 4,
        "text_review": "I have been doing it for 2 years. It is quite easy to do and there are some things that can be improved.",
        "date": "2025-09-07 01:27:58"
    },
    {
        "user_name": "Sri Nandish B.M.",
        "rating": 4,
        "text_review": "Loved the features except get cash against holdings or mutual fund. There should be option to hide this message if one is not interested in getting this. It looks like advertisement banner.",
        "date": "2025-09-06 20:39:30"
    },
    {
        "user_name": "om parkash Rajta",
        "rating": 4,
        "text_review": "main and important facility of SWP and TSL TRAILING STOP LOSS not given. which should be given urgently. I think other users might agree with me that company provides it early.",
        "date": "2025-09-06 06:48:50"
    },
    {
        "user_name": "Abhinav Narayan",
        "rating": 4,
        "text_review": "after help from their support team. I was able to consolidate my portfolio. App is smooth and works fine. Though there are still area of opportunities that can be worked upon . Eg. It cannot compare to my overall family portfolio and give me suggestions if there is any duplication etc. But overall its good",
        "date": "2025-09-03 22:15:03"
    },
    {
        "user_name": "Akhilesh Singh",
        "rating": 5,
        "text_review": "all in one best application all investment ek platform pe mutual fund fd insurance, konsa sa fund underperforming hai aur konsa outperform all details in one app.",
        "date": "2025-11-27 13:39:38"
    },
    {
        "user_name": "Hari ツB",
        "rating": 5,
        "text_review": "Good app no hidden charges except 299 for instant deposit and free withdrawal. No charges for buying and selling stock. Please introduce stop loss.... Edit They introduced stop loss and brokerage",
        "date": "2025-11-27 11:39:35"
    },
    {
        "user_name": "Mohan Karadi",
        "rating": 5,
        "text_review": "hi please change the home interface for ind stocks like invested amount, current value, Total investment value and Absolute return and 1 day return . please apply all this in one place in Ind stocks home screen in green and black colour with good font style, so that it will helpfull and attractive.. I can see that mutual fund home screen is looking good. I hope this will apply ASAP.",
        "date": "2025-11-26 17:19:01"
    },
    {
        "user_name": "Prajjwal Gautam",
        "rating": 5,
        "text_review": "It is one of the best app for equity as well as FO trading.",
        "date": "2025-11-26 11:37:07"
    },
    {
        "user_name": "Partheeban Janarthanan",
        "rating": 5,
        "text_review": "It still doesnt track NPS Tier 2. Would be helpful if it is added instead of manually tracking it as a separate category.",
        "date": "2025-11-26 09:54:55"
    },
    {
        "user_name": "Sree S",
        "rating": 5,
        "text_review": "absolutly amazing indepth details unlike other mf or stock app.",
        "date": "2025-11-25 16:59:21"
    },
    {
        "user_name": "Vijay Kumar",
        "rating": 5,
        "text_review": "Ind money safe and secure Life Time Saving money good I am impressed really 7",
        "date": "2025-11-24 18:50:32"
    },
    {
        "user_name": "Tyagi",
        "rating": 5,
        "text_review": "I didnt like the recent update of app interface, previous one was user friendly please try to change it.",
        "date": "2025-11-24 09:22:59"
    },
    {
        "user_name": "Nagaraj V",
        "rating": 5,
        "text_review": "Best trading app in India. Thanks to the indmoney team.",
        "date": "2025-11-22 12:56:51"
    },
    {
        "user_name": "Lincoln Moirangthem",
        "rating": 5,
        "text_review": "its a great platform to buying stock for my experience.",
        "date": "2025-11-21 14:16:49"
    },
    {
        "user_name": "Rajat Kaundal",
        "rating": 5,
        "text_review": "Simplest way to deep dive into Indian as well as Us market just by simple click... they analyse the strengthen and weakness of ur portfolios Health cover , Vehicle Insurance ,life cover everything in single App...",
        "date": "2025-11-21 07:25:45"
    },
    {
        "user_name": "Upendar Girikala",
        "rating": 5,
        "text_review": "Excellent app! Easy to use and very helpful in daily tasks.",
        "date": "2025-11-20 20:03:27"
    },
    {
        "user_name": "Surajit Maji",
        "rating": 5,
        "text_review": "Indmoney provide lot of advanced features that your investment or trading journey more easy. This app interface very attractive . This app very fast . IND Money is a all in online solution for stock market. . 20.08.25 IND Money new update for Indian Stocks very impressive . 20.11.25 New update regarding watchlist is good.",
        "date": "2025-11-20 10:52:00"
    },
    {
        "user_name": "Subba Reddy",
        "rating": 5,
        "text_review": "nice application no server issues... us stocks amazing .. i refer to my friends this application...",
        "date": "2025-11-19 18:30:56"
    },
    {
        "user_name": "VISHWANATH T S",
        "rating": 5,
        "text_review": "Best app for Indian stocks, mutual funds and foreign stocks. All in one app.",
        "date": "2025-11-19 12:31:08"
    },
    {
        "user_name": "souvik s",
        "rating": 5,
        "text_review": "Great app for investing in Indian US stocks, IPOs, SIPs, Mutual Funds checking your net worth all in one place keep it up.",
        "date": "2025-11-18 20:31:28"
    },
    {
        "user_name": "Kanmaya E",
        "rating": 5,
        "text_review": "very good application. great option of 10k mtf funding without interest. hope you wont make changes in upcoming days.",
        "date": "2025-11-18 11:01:07"
    },
    {
        "user_name": "Krishna Kumar Goel",
        "rating": 5,
        "text_review": "Hoping for a zero Forex lifetime free credit card for stocks, equity, IPO, mutual funds purchases and domestic as well as international use",
        "date": "2025-11-18 04:45:54"
    },
    {
        "user_name": "Sushant A",
        "rating": 5,
        "text_review": "the tracking of external mf is not real time and even it doesnt get updated as per actual. other competitors have much better UI to track external mf on one app. please consider this feedback.",
        "date": "2025-11-17 16:58:46"
    },
    {
        "user_name": "Rahul Varma",
        "rating": 5,
        "text_review": "Love the app. Especially for US investing. Feedback Please add XIRR into stock performance. Theres no way to see XIRR at the moment.",
        "date": "2025-11-17 10:18:05"
    },
    {
        "user_name": "Amitz jadav",
        "rating": 5,
        "text_review": "help full app , very transparent , its nice choice",
        "date": "2025-11-16 08:22:03"
    },
    {
        "user_name": "Virendra Kumar",
        "rating": 5,
        "text_review": "The application is nice and easy to access. It seems authentic as it takes all legal formalities like eSign and Aadhaar authentication while registering the application. Advisable to new investors.",
        "date": "2025-11-15 12:54:34"
    },
    {
        "user_name": "Harun N",
        "rating": 5,
        "text_review": "very nice app easy too use and good staff and payment is very easy I love it",
        "date": "2025-11-15 09:14:27"
    },
    {
        "user_name": "perumal kandasamy",
        "rating": 5,
        "text_review": "very good app for locals as well as NRI s",
        "date": "2025-11-14 08:36:55"
    },
    {
        "user_name": "Sunil Kumar",
        "rating": 5,
        "text_review": "great, lots of improvment made by team specially in trading, pnl etc...now please provide a stong full api support like option chain data through api etc",
        "date": "2025-11-14 07:52:23"
    },
    {
        "user_name": "Senraya Perumal",
        "rating": 5,
        "text_review": "aap is not supported for full function. Sometimes the app hangs. could not continuity used.",
        "date": "2025-11-13 09:28:11"
    },
    {
        "user_name": "Awesome Ak",
        "rating": 5,
        "text_review": "Awesome App ! One feature which I feel would be awesome option to view everyday returns in like a history or chart so that we have an idea which days were good. Please consider dev team.",
        "date": "2025-11-12 22:19:44"
    },
    {
        "user_name": "Joy Gabriel",
        "rating": 5,
        "text_review": "This app is really good for online stock trading",
        "date": "2025-11-12 07:17:06"
    },
    {
        "user_name": "Omkar Pawar",
        "rating": 5,
        "text_review": "Excellent app for managing personal finance and investments. The integration of stocks, mutual funds, and US investments in one platform is really helpful. Smooth experience so far!",
        "date": "2025-11-12 06:33:58"
    },
    {
        "user_name": "Anmol Gupta",
        "rating": 5,
        "text_review": "Your old UI was better than this one, you should not change your UI every week l you were already way better than other trading apps.",
        "date": "2025-11-11 16:00:41"
    },
    {
        "user_name": "Binu M B",
        "rating": 5,
        "text_review": "Nice but needs a feature addition. In the myInd asset section, i have added gold and real estate details. But in the transaction details, which is optional but very beneficial, there is no option to add text details. This is very important as we can add the name of ornament or additional details about a transaction to bring more clarity when having multiple transactions.",
        "date": "2025-11-11 15:04:45"
    },
    {
        "user_name": "Dilip Goyal",
        "rating": 5,
        "text_review": "To solve problem there should be local office,so that investor can easily involve and solve their problem",
        "date": "2025-11-11 07:19:25"
    },
    {
        "user_name": "Wanijahangir Wanijahangir",
        "rating": 5,
        "text_review": "NO MORE APP HAVE SUCH TYPE OF FUNCTIONS,AS A INDMONEY HAVE. I LIKE THIS APP AND LOVE THIS APP",
        "date": "2025-11-07 21:29:42"
    },
    {
        "user_name": "Nishant Agarwal",
        "rating": 5,
        "text_review": "i have added my family member but there mutual fund not updating , I have redeem the fund but its still showing , I cant refresh that",
        "date": "2025-11-07 18:51:26"
    },
    {
        "user_name": "Harshavardhan S",
        "rating": 5,
        "text_review": "Superb application, All in one App. I am able to Save amount and invest wisely in suggested US stocks, pay utilities Bill on the go, Wonderful app for UPI payments as well. I have using it for most of my daily requirements, Thank you IND Money for wonderful experience",
        "date": "2025-11-06 22:26:44"
    },
    {
        "user_name": "Bhavya Shokeen",
        "rating": 5,
        "text_review": "Please bring back the option to see the top gainer stocks in all of the market again. Edit Issue has now been resolved as their team member guided me on how to access it.",
        "date": "2025-11-05 13:28:48"
    },
    {
        "user_name": "kiran",
        "rating": 5,
        "text_review": "edited review after months ,now withdrawals became very fast ... Thankyouu!",
        "date": "2025-11-04 10:25:42"
    },
    {
        "user_name": "DEVENDRAKUMAR CHAUHAN",
        "rating": 5,
        "text_review": "XIRR not Showing in Apps which mutual fund recently added Current Year . But Blended XIRR Shown.",
        "date": "2025-11-04 03:50:02"
    },
    {
        "user_name": "HASHIRA.Z CHISHTY",
        "rating": 5,
        "text_review": "nice ...good to know more n more loved it nw...",
        "date": "2025-11-04 01:02:18"
    },
    {
        "user_name": "Saikumar Reddy",
        "rating": 5,
        "text_review": "The feature I like most in this IndMoney app is that it sync fetch all Mutual funds.. I really liked it as I am able to manage my all MFs from here. Thanks!",
        "date": "2025-11-03 22:31:17"
    },
    {
        "user_name": "Akhilesh Kumar",
        "rating": 5,
        "text_review": "Us investment made easy. So far has not faced any blockers.",
        "date": "2025-11-03 21:04:16"
    },
    {
        "user_name": "Sachin Kapoor",
        "rating": 5,
        "text_review": "It has wide range of features, simple to use. It provides smart financial planning tools and provides you the opportunity to invest in the US market alongside the Indian stock market.",
        "date": "2025-11-02 19:31:33"
    },
    {
        "user_name": "Preeti Deshpande",
        "rating": 5,
        "text_review": "Great UI. Much, much better than Groww and Vested. Very intuitive and userfriendly.",
        "date": "2025-11-02 01:35:59"
    },
    {
        "user_name": "Ashish Pandey",
        "rating": 5,
        "text_review": "overall everything is good.please update one more feature in this app that our under performing funds which we have to close and exit and the rest money of that fund we can invest somewhere else...",
        "date": "2025-10-31 21:53:31"
    },
    {
        "user_name": "tesang mahto",
        "rating": 5,
        "text_review": "the app is not showing my liabilities like before after the updates",
        "date": "2025-10-30 19:12:36"
    },
    {
        "user_name": "History With me",
        "rating": 5,
        "text_review": "I really in search of loan but every app denied it. but InD money given me and fullfill my need at very very ROI. I will personally recomend this app.it complete my application in 10 minute and disburse amount in acct.",
        "date": "2025-10-30 17:42:19"
    },
    {
        "user_name": "narendra pathak",
        "rating": 5,
        "text_review": "nice application because its option for all in one and investment in FD, Insurance and Indian stocks market as well as US stock market . Its good for ipos.",
        "date": "2025-10-30 16:38:52"
    },
    {
        "user_name": "vignesh ravi",
        "rating": 5,
        "text_review": "Very Responsive App and Beautifully Designed to make investments simple for everyone",
        "date": "2025-10-30 08:18:43"
    },
    {
        "user_name": "Shahnawaz Mansoori (Shanu)",
        "rating": 5,
        "text_review": "App is good, please add liability edit option to add more liability like rent, monthly expenses and other borrowed money.",
        "date": "2025-10-30 00:48:43"
    },
    {
        "user_name": "Mantha SURYA PRAKASH",
        "rating": 5,
        "text_review": "Ease of operations and investment friendly features whether it is domestic or US",
        "date": "2025-10-29 22:13:07"
    },
    {
        "user_name": "Sanjeev Kumar",
        "rating": 5,
        "text_review": "amazing all investment showing in one place ...",
        "date": "2025-10-28 17:17:28"
    },
    {
        "user_name": "Kumar Arvind",
        "rating": 5,
        "text_review": "easy navigation. first experience is superb experience. A must use app.",
        "date": "2025-10-26 17:19:16"
    },
    {
        "user_name": "Sagar kumar",
        "rating": 5,
        "text_review": "The smooth performance and quick response time make this app one of the most reliable payment platforms Ive used, especially when transferring money urgently to family or friends..",
        "date": "2025-10-25 21:57:33"
    },
    {
        "user_name": "Mayur Shukla",
        "rating": 5,
        "text_review": "issue resolved after escalation. However overall its good service only.",
        "date": "2025-10-24 19:35:27"
    },
    {
        "user_name": "Sharath Vs",
        "rating": 5,
        "text_review": "good.. can improve app... customer support is good.. but need to improve app.. software side..",
        "date": "2025-10-24 12:15:20"
    },
    {
        "user_name": "Tata Nagaraju",
        "rating": 5,
        "text_review": "please change the user interface to the previous one The current one gives confusion",
        "date": "2025-10-23 09:13:18"
    },
    {
        "user_name": "Amit Amit",
        "rating": 5,
        "text_review": "Feature request for mutual fund. There should be an option to see the amount on which the exit load is zero. this will help users saving the money Changing rating back to 5.",
        "date": "2025-10-22 14:46:13"
    },
    {
        "user_name": "ashish rawat",
        "rating": 5,
        "text_review": "Hi, are there any plans of starting options trading in US stocks in the app?",
        "date": "2025-10-22 13:12:55"
    },
    {
        "user_name": "Ayan Raza",
        "rating": 5,
        "text_review": "thanks you sir God bless you all work always Sir",
        "date": "2025-10-21 10:00:06"
    },
    {
        "user_name": "PRASANTA DEBNATH",
        "rating": 5,
        "text_review": "Crypto buying features required in here everything is fine ...",
        "date": "2025-10-18 20:12:32"
    }
]